Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/add_folio.po
Languages: cs

source: Add new Folio
cs: Přidání nového listu

source: QElectroTech allows creating `folios`_ from `menu bar`_, `projects panel`_, `folios tabs bar`_ and using the corresponding keyboard shortcut.
cs: QElectroTech umožňuje vytvářet `listy`_ z `hlavní nabídky`_, `panelu s projekty`_, `pruhu karet s listy`_ a pomocí odpovídající klávesové zkratky.

source: Add new folio from menu bar
cs: Přidání nového listu z hlavní nabídky

source: Select **Project > Add a folio** menu item to add a new `folio`_ to the active `project`_.
cs: Pro přidání nového `listu`_ do činného `projektu`_ vyberte položku nabídky **Projekt > Přidat list**.

source: Figure: QElectroTech Project menu
cs: Obrázek: Nabídka projektu v QElectroTechu

source: Add new folio from projects panel
cs: Přidání nového listu z panelu s projekty

source: Right click on the `project`_ where a new `folio`_ should be added.
cs: Klepnutí pravým tlačítkem myši na `projekt`_ kde se má přidat nový `list`_.

source: Click the option **Add a folio** to add a new `folio`_ to the `project`_.
cs: Klepněte na volbu **Přidat list** pro přidání nového `listu`_ do `projektu`_.

source: Figure: QElectroTech Project panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: If the `projects panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**

source: Add new folio from folios tabs bar
cs: Přidání nového listu z pruhu karet s listy

source: Click on the **Add folio** icon |folio-new| from right side of the `folios tabs bar`_ to add a new `folio`_ to the active `project`_.
cs: Klepněte na ikonu **Přidat list** |folio-new| z pravé strany `pruhu karet s listy`_ pro přidání nového `listu`_ do činného `projektu`_.

source: Add new folio using keyboard shortcut
cs: Přidání nového listu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + t`` to add a new `folio`_ to the active `project`_.
cs: Stiskněte klávesy ``Ctrl + t`` pro přidání nového `listu`_ do činného `projektu`_.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
