Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/select/select_multiple_parts.po
Languages: cs

source: Select multiple parts
cs: Vybrání více částí

source: As many CAD tools, many `parts`_ (`Line`_, `Rectangle`_, `Ellipse`_, `Arc`_, `Polygon`_, `Terminal`_, `text`_ and `dynamic text field`_) from `workspace`_ can be selected at the same time.
cs: Tak jako mnoho nástrojů CAD, mnoho `částí`_ (`Čára`_, `Obdélník`_, `Elipsa`_, `Oblouk`_, `Mnohoúhelník`_, `Svorka`_, `text`_ a `dynamické textové pole`_) v `pracovní ploše`_ lze vybrat současně.

source: Select multiple objects using keyboard and mouse
cs: Vybrání více předmětů pomocí klávesové zkratky nebo myši

source: QElectroTech allows selecting multiple `parts`_ from the `workspace`_ combining the use of the keyboard and mouse.
cs: QElectroTech umožňuje výběr více `částí`_ v `pracovní ploše`_ spojující použití klávesnice a myši.

source: `Select`_ the first `part`_.
cs: `Vyberte`_ první `část`_.

source: Press ``Ctrl``.
cs: Stiskněte ``Ctrl``.

source: `Select`_ the rest of `parts`_ without releasing ``Ctrl``.
cs: `Vyberte`_ zbytek `částí`_ bez uvolnění klávesy ``Ctrl``.

source: Figure: QElectroTech schema
cs: Obrázek: Výkres v QElectroTechu

source: Select multiple objects by selecting area
cs: Vybrání více předmětů pomocí výběru oblasti

source: QElectroTech allows selecting all `parts`_ from a defined area using the mouse.
cs: QElectroTech umožňuje vybrat všechny `části`_ ve stanovené oblasti pomocí myši.

source: Left click on the initial point from the rectangular area to be selected and displace the mouse without releasing the button.
cs: Klepněte levým tlačítkem na počáteční bod obdélníkové oblasti, kterou chcete vybrat, a přesuňte myš bez uvolnění tlačítka.

source: Figure: QElectroTech selecting on workspace
cs: Obrázek: Výběr v pracovní ploše v QElectroTechu
