Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/select/select_all.po
Languages: cs

source: Select all Parts
cs: Vybrání všech částí

source: QElectroTech allows selecting all `parts`_ from the `workspace`_, all `parts`_ from the opened `element`_, at the same time.
cs: QElectroTech umožňuje vybrat všechny `části`_ v `pracovní ploše`_, všechny části otevřeného `prvku`_ současně.

source: All `parts`_ can be selected from `menu bar`_, `workspace`_ or using the corresponding keyboard shortcut.
cs: Všechny `části`_ lze vybrat přes `hlavní nabídku`_, `pracovní plochu`_ a pomocí odpovídající klávesové zkratky.

source: Select all parts from menu bar
cs: Vybrání všech částí přes hlavní nabídku

source: Select **Edit > Select all** menu item to select all `parts`_ from the opened `element`_.
cs: Pro vybrání všech `části`_ otevřeného `prvku`_ vyberte položku nabídky **Úpravy > Vybrat vše**.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Select all parts from workspace
cs: Vybrání všech částí v pracovní ploše

source: As many other CAD tools, QElectroTech allows selecting all `parts`_ from the `workspace`_ using the mouse.
cs: Tak jako mnohé jiné nástroje CAD QElectroTech umožňuje vybrat všechny `části`_ v `pracovní ploše`_, pomocí myši.

source: Left click on the initial point from the rectangular area to be selected and displace the mouse without releasing the button.
cs: Klepněte levým tlačítkem na počáteční bod obdélníkové oblasti, kterou chcete vybrat, a přesuňte myš bez uvolnění tlačítka.

source: Figure: QElectroTech element editor selecting on workspace
cs: Obrázek: Výběr v pracovní ploše v editoru prvku v QElectroTechu

source: Select all objects using keyboard shortcut
cs: Vybrání všech předmětů pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + a`` to select all `parts`_ from the opened `element`_.
cs: Pro vybrání všech `části`_ otevřeného `prvku`_ stiskněte ``Ctrl + a``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
