Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/element_editor/edition/graphic/parts/select/select_invert.po
Languages: cs

source: Invert the selection
cs: Obrácení výběru

source: Some times is easier to select the `parts`_ from the `workspace`_ which are not interested for the desired action than the `parts`_ which should be selected. For this reason, QElectroTech provides the option to invert the selection.
cs: Někdy je snazší vybrat `části`_ v `pracovní ploše`_, jež pro požadovanou činnost nejsou zajímavé, než části, které mají být vybrány. Z tohoto důvodu QElectroTech poskytuje možnost obrátit výběr.

source: Inverting the selection can be done from `Menu bar`_ or using the corresponding keyboard shortcut.
cs: Obrácení výběru lze provést přes `hlavní nabídku`_ nebo pomocí odpovídající klávesové zkratky.

source: Invert selection from menu bar
cs: Obrácení výběru přes hlavní nabídku

source: `Select the part/s`_ from the opened `element`_ which are not interested for the desired action.
cs: `Vyberte část/části`_ otevřeného `prvku`_, jež nejsou zajímavé pro požadovanou činnost.

source: Select **Edit > Invert selection** to invert the selection.
cs: Pro obrácení výběru vyberte **Úpravy > Obrátit výběr**

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Invert selection using keyboard shortcut
cs: Obrácení výběru pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + i`` to invert the selection.
cs: Pro obrácení výběru stiskněte ``Ctrl + i``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
