Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/type/element_master.po
Languages: cs

source: Master element
cs: Nadřízený prvek

source: The master elements represent the devices from the command circuit such the coil from a relay or contactor.
cs: Nadřízené prvky představují zařízení v příkazovém obvodu, jako jsou cívka relé nebo stykače.

source: Figure: QElectroTech master element
cs: Obrázek: Nadřízený prvek v QElectroTechu

source: For master element exist two type of variables, the general variables that are common for all type of elements and managed internally by QElectroTech, and the specific variables for this type of element.
cs: Pro nadřízený prvek existují dva typy proměnných, obecné proměnné, které jsou společné pro všechny typy prvků a jsou spravovány vnitřně QElectroTechem, a zvláštní proměnné pro tento typ prvku.

source: QElectroTech allows defining variable values from master element at the **Selection properties** panel. QElectroTech does not allow defining new variables. QElectroTech allows only displaying variables at dynamic texts and define value of the specific variables.
cs: QElectroTech umožňuje stanovit hodnoty proměnných nadřízeného prvku v panelu **Vlastnosti výběru**. QElectroTech neumožňuje definovat nové proměnné. QElectroTech umožňuje zobrazení proměnných pouze u dynamických textů a stanovit hodnotu zvláštních proměnných.

source: If the Selection properties panel is not displayed, it can be displayed from **Settings > Display > Selection properties**.
cs: Pokud se panel s vlastnostmi výběru nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**.

source: General variables
cs: Obecné proměnné

source: **% {F}**: Label from the folio where the element can be found
cs: **% {F}**: Štítek listu, kde lze prvek najít

source: **% {f}**: Number from the folio where the element can be found
cs: **% {f}**: Číslo listu, kde lze prvek najít

source: **% {M}**: Plant variable from the folio where the element can be found
cs: **% {M}**: Proměnná plant listu, kde lze prvek najít

source: **% {LM}**: Location variable of the folio where the element can be found
cs: **% {LM}**: Proměnná umístění listu, kde lze prvek najít

source: **% {l}**: Folio line number from the workspace where the element can be found
cs: **% {l}**: Číslo řádku listu pracovní plochy, kde lze prvek najít

source: **% {c}**: Folio column number from the workspace where the element can be found
cs: **% {c}**: Číslo sloupce listu pracovní plochy, kde lze prvek najít

source: **% {id}**: Folio position in the project (Schema number)
cs: **% {id}**: Poloha listu v projektu (číslo výkresu)

source: Specific variables
cs: Zvláštní proměnné

source: **Label formula**: Definition of the formula which defines the **Label** value. If a auto numbering pattern is selected during terminal creation, QElectroTech defiens ``%autnum`` as default formula.
cs: **Vzorec štítku**: Definice vzorce, který stanovuje hodnotu **štítku** Pokud je během vytváření svorky vybrán vzor automatického číslování, QElectroTech stanoví jako výchozí vzorec ``% autnum``.

source: **Label**: Internal variable which is used to defines the element code.
cs: **Štítek**: Vnitřní proměnná, která se používá ke stanovení kódu prvku.

source: **Annotation**: Internal variable, it cannot be a formula (group of other variables).
cs: **Poznámka**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Textual description**: Internal variable, it cannot be a formula (group of other variables).
cs: **Textový popis**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Article number**: Internal variable which, it cannot be a formula (group of other variables).
cs: **Číslo článku**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Manufacturer**: Internal variable, it cannot be a formula (group of other variables).
cs: **Výrobce**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Order number**: Internal variable, it cannot be a formula (group of other variables).
cs: **Číslo objednávky**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Supplier**: Internal variable, it cannot be a formula (group of other variables).
cs: **Dodavatel**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Auxiliry block 1**: Internal variable, it cannot be a formula (group of other variables).
cs: **Pomocný blok 1**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Auxiliry block 2**: Internal variable, it cannot be a formula (group of other variables).
cs: **Pomocný blok 2**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Internal number**: Internal variable, it cannot be a formula (group of other variables).
cs: **Vnitřní číslo**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Location**: Internal variable, it cannot be a formula (group of other variables).
cs: **Umístění**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Function**: Internal variable, it cannot be a formula (group of other variables).
cs: **Funkce**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).

source: **Voltage/Protocol**: Internal variable, it cannot be a formula (group of other variables).
cs: **Napětí/Protokol**: Vnitřní proměnná, nemůže to být vzorec (skupina jiných proměnných).
