Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/type/reference_folio_following.po
Languages: cs

source: Reference folio following
cs: Odkaz na následující list

source: Element which link the end of a `conductor`_ with the begining of the `conductor`_ represented at previous, following or the same `folio`_.
cs: Prvek, který spojuje konec `vodiče`_ se začátkem vodiče znázorněným na předchozím, následujícím nebo stejném `listu`_.

source: Figure: QElectroTech reference folio following
cs: Obrázek: Odkaz na následující list v QElectroTechu

source: For reference folio following element exist two type of variables, the general variables that are common for all type of `elements`_ and the specific variables for this type of `element`_.
cs: Pro prvek odkaz na následující list existují dva typy proměnných, obecné proměnné, které jsou společné pro všechny typy `prvků`_ a zvláštní proměnné pro tento typ `prvku`_.

source: QElectroTech does not allow defining variable values for this type of `element`_. QElectroTech does also not allows defining new variables. QElectroTech allows only displaying the specific variables at `dynamic texts`_.
cs: QElectroTech neumožňuje stanovit hodnoty proměnných pro tento typ `prvku`_. QElectroTech také neumožňuje stanovit nové proměnné. QElectroTech umožňuje pouze zobrazení konkrétních proměnných u `dynamických textů`_.

source: General variables
cs: Obecné proměnné

source: **% {F}**: Label from the `folio`_ where the `element`_ can be found.
cs: **% {F}**: Štítek `listu`_, kde lze `prvek`_ najít.

source: **% {f}**: Number from the `folio`_ where the `element`_ can be found.
cs: **% {f}**: Číslo `listu`_, kde lze `prvek`_ najít.

source: **% {M}**: Plant variable from the `folio`_ where the `element`_ can be found.
cs: **% {M}**: Proměnná plant `listu`_, kde lze `prvek`_ najít.

source: **% {LM}**: Location variable of the `folio`_ where the `element`_ can be found.
cs: **% {LM}**: Proměnná umístění `listu`_, kde lze `prvek`_ najít.

source: **% {l}**: Folio line number from the `workspace`_ where the `element`_ can be found.
cs: **% {l}**: Číslo řádku v listu `pracovní plochy`_, kde lze `prvek`_ najít.

source: **% {c}**: Folio column number from the `workspace`_ where the `element`_ can be found.
cs: **% {c}**: Číslo sloupce v listu `pracovní plochy`_, kde lze `prvek`_ najít.

source: **% {id}**: Folio position in the `project`_ (Schema number).
cs: **% {id}**: Poloha listu v `projektu`_ (číslo výkresu).

source: Specific variables
cs: Zvláštní proměnné

source: **Function**: Function property from the `conductor`_ connected to the `element terminal`_.
cs: **Funkce**: Vlastnost funkce `vodiče`_ připojeného ke `svorce prvku`_.

source: **Label**: Internal variable which defines the position of the linked `previous reference folio`_ element.
cs: **Štítek**: Vnitřní proměnná, která stanovuje polohu propojeného prvku `Odkaz na předchozí list`_.

source: **Voltage/Protocol**: Voltage/Protocol property from the `conductor`_ connected to the `element terminal`_.
cs: **Napětí/Protokol**: Vlastnost Napětí/Protokol `vodiče`_ připojeného ke `svorce prvku`_.

source: The **Label** property can be defined as a formula by the user at `New folio`_ section from `project properties`_. By default the formula is ``%id-%l%c``, variables took from `previous reference folio`_ linked element.
cs: Vlastnost **Štítek** může uživatel stanovit jako vzorec v části **Nový list** `vlastností projektu`_. Ve výchozím nastavení je vzorec ``%id-%l%c``. Proměnné jsou převzaty z propojeného prvku `Odkaz na předchozí list`_.

source: For more information about how to define the **Label** formula, please refers to `folio referencing project properties`_.
cs: Další informace o tom, jak stanovit vzorec pro **Štítek**, naleznete v části `vlastnosti odkazování listů v projektu`_.
