Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/language.po
Languages: cs

source: Select language
cs: Výběr jazyka

source: QElectroTech is a multilanguage tool already translated to 21 languages.
cs: QElectroTech používají lidé hovořící různými jazyky. Je přeložen již do 21 jazyků.

source: To select the working language:
cs: Pro vybrání pracovního jazyka:

source: `Display`_ QElectroTech settings PopUP window.
cs: `Zobrazte` vyskakovací okno s nastavením QElectroTechu.

source: Go to **General** section.
cs: Jděte do části **Obecné**.

source: Go to **Language** tab.
cs: Jděte na kartu **Jazyk**.

source: Spread out the combo box and select the desired language.
cs: Rozbalte rozbalovací seznam a vyberte požadovaný jazyk.

source: Press **OK** button to save the configuration changes and close settings PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavření vyskakovacího okna s nastavením.

source: The changes are applied at the next launch, `quit`_ and `launch`_ again QElectroTech.
cs: Změny se použijí při příštím spuštění, `ukončení`_ a opětovném `spuštění`_ QElectroTechu.

source: Figure: QElectroTech configure language section
cs: Obrázek: Část pro nastavení jazyka v QElectroTechu
