Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/settings_element.po
Languages: cs

source: Element settings
cs: Nastavení prvku

source: Figure: QElectroTech elements settings
cs: Obrázek: Nabídka pro prvky v QElectroTechu

source: Collection settings
cs: Nastavení sbírky

source: QElectroTech allows choosing the path from the `QET (Common)`_ and `User`_ element collection. The path from `User Title Block`_ collection can also be choosed. The collections directory can be at the local Hard Disk, common users, or at local servers, common for companies.
cs: QElectroTech umožňuje zvolit cestu ke sbírkám prvků `QET`_ (společná) a `vlastní`_. Lze zvolit i cestu ke sbírce s `vlastními záhlavními výkresu`_ lze také zvolit. Adresář se sbírkami může být na místním pevném disku, společném pro uživatele, nebo na místních serverech, společných pro společnosti.

source: The default element collection paths depend on the installation settings choosed during the installation process.
cs: Výchozí cesty ke sbírkám s prvky závisí na nastavení instalace zvoleném během procesu instalace.

source: Example
cs: Příklad

source: QET collection
cs: Sbírka QET

source: Mac
cs: macOS

source: User collection
cs: Vlastní sbírka

source: For changing the element collection paths of QElectroTech:
cs: Pro změnu cest ke sbírkám prvků QElectroTechu:

source: `Display`_ QElectroTech settings PopUP window.
cs: `Zobrazte` vyskakovací okno s nastavením QElectroTechu.

source: Go to **Elements** section.
cs: Jděte do části **Prvky**.

source: Search and choose the folder directory from the `QET (Common)`_ and `User`_ element collection at the **Collection of elements** section.
cs: Vyhledejte a vyberte adresář složek se sbírkami prvků `QET`_ (společná) a `vlastní`_ v části **Sbírka prvků**.

source: Press **OK** button to save the configuration changes and close settings PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavřete vyskakovací okno s nastavením.

source: QElectroTech has to be restarted to implement the changes.
cs: Aby bylo možné změny uskutečnit, je nutné spustit QElectroTech znovu.

source: Element management settings
cs: Nastavení správy prvku

source: QElectroTech provides the posibility to predefine the `element author`_. In this way; when a new `element`_ is created, QElectroTech defines automatically this `element property`_.
cs: QElectroTech poskytuje možnost předem stanovit `autora prvku`_. Takto, když je vytvořen nový `prvek`_, QElectroTech automaticky stanoví tuto `vlastnost prvku`_.

source: For pre-defining the `element author`_ information:
cs: Pro stanovení údaje o `autorovi prvku`_ předem:

source: Defines the element author and license information at the text box from **Elements management** section.
cs: Stanoví informace o autorovi prvku a licenci v textovém poli v části **Správa prvků**.
