Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/settings_text.po
Languages: cs

source: Text settings
cs: Nastavení textu

source: Before starting to work, QElectroTech allows defining the default appearence of the different texts.
cs: Před zahájením práce QElectroTech umožňuje stanovit výchozí vzhled různých textů.

source: Elements texts
cs: Texty prvků

source: Independent texts
cs: Nezávislé texty

source: QElectroTech allows defining a default orientation and text font from the text field object.
cs: QElectroTech umožňuje stanovit výchozí natočení a textové písmo předmětu v textovém poli.

source: Click at the button from the text font to display the `select font PopUp window`_.
cs: Klepněte na tlačítko v písmu textu pro zobrazení `vyskakovacího okna pro výběr písma`_.

source: Select a default rotation angle for the text.
cs: Vyberte výchozí úhel otočení textu.

source: Oposite to the geometrical angle, QElectroTech use the clock direction to define angles.
cs: Na rozdíl od geometrického úhlu používá QElectroTech k určení úhlů směr hodinové ručičky.

source: Figure: QElectroTech dynamic texts settings
cs: Obrázek: Nastavení dynamického textu v QElectroTechu

source: Summary pages
cs: Strany souhrnu

source: QElectroTech allows defining a default text font from the project summary table.
cs: QElectroTech umožňuje stanovit výchozí písmo textu v tabulce s přehledem projektu.

source: Other texts
cs: Jiné texty

source: QElectroTech allows defining a default orientation and text font for the text that is not part from an element, text field object and from the project summary.
cs: QElectroTech umožňuje stanovit výchozí natočení a písmo textu pro text, který není součástí prvku, předmětu textového pole a přehledu projektu.
