Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/cells_merge.po
Languages: cs

source: Merge cells
cs: Sloučit buňky

source: QElectroTech `title block editor`_ allows merging `cells`_ from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: `Editor záhlaví výkresu`_ QElectroTechu umožňuje sloučení `buněk`_ přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: QElectroTech has no restrictions merging `cells`_, QElectroTech allows merging `cells`_ from same `column`_ and/or `row`_.
cs: QElectroTech nemá žádná omezení na slučování `buněk`_. QElectroTech umožňuje slučování buněk ze stejného `sloupce`_ a / nebo `řádku`_.

source: Merge cells from menu bar
cs: Sloučení buněk přes hlavní nabídku

source: Select the `cells`_ which should be merged.
cs: Vyberte `buňky`_, které mají být sloučeny.

source: Select **Edit > Merge cells** menu item to merge the selected `cells`_.
cs: Pro sloučení vybraných `buněk`_ vyberte položku nabídky **Upravit > Sloučit buňky**.

source: Figure: QElectroTech title block editor, edit menu
cs: Obrázek: Nabídka Úpravy editoru záhlaví výkresu v QElectroTechu

source: To select more than one `cell`_, press **Ctrl** from keyboard.
cs: Pro vybrání více než jedné `buňky`_ stiskněte **Ctrl** na klávesnici.

source: Merge cells from toolbar
cs: Sloučení buněk přes pruh s nástroji

source: Select the icon |icon_merge| from `toolbar`_ to merge the selected `cells`_.
cs: Vyberte ikonu |icon_merge| v `panelu nástrojů`_ pro sloučení vybraných `buněk`_.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Edit**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Úpravy**

source: Merge cells using keyboard shortcut
cs: Sloučení buněk pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + j`` to merge the selected `cells`_.
cs: Pro sloučení vybraných `buněk`_ stiskněte ``Ctrl + j``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
