Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/cells_split.po
Languages: cs

source: Split cells
cs: 6Rozdělení buněk

source: QElectroTech `title block editor`_ allows splitting `cells`_ previously `merged`_ from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: `Editor záhlaví výkresu`_ QElectroTechu umožňuje rozdělení předtím `sloučených`_ `buněk`_ přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: Split cells from menu bar
cs: Rozdělení buněk přes hlavní nabídku

source: Select the merged `cells`_ which should be splitted.
cs: Vyberte sloučené `buňky`_, které mají být rozděleny.

source: Select **Edit > Split cells** menu item to split the selected `cells`_.
cs: Pro rozdělení vybraných `buněk`_ vyberte položku nabídky **Úpravy > Rozdělit buňky**.

source: Figure: QElectroTech title block editor, edit menu
cs: Obrázek: Nabídka Úpravy editoru záhlaví výkresu v QElectroTechu

source: Split cells from toolbar
cs: Rozdělení buněk přes pruh s nástroji

source: Select the icon |icon_split| from the `toolbar`_ to split the selected `cells`_.
cs: Vyberte ikonu |icon_split| v `panelu nástrojů`_ pro rozdělení vybraných`buněk`_.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Edit**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Úpravy**

source: Split cells using keyboard shortcut
cs: Rozdělení buněk pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + k`` to split the selected `cells`_.
cs: Pro rozdělení vybraných `buněk`_ stiskněte ``Ctrl + k``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
