Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/cells_value.po
Languages: cs

source: Define cell content
cs: Stanovení obsahu buňky

source: QElectroTech `title block editor`_ allows defining two differen types of content in a `text cell`_ type:
cs: `Editor záhlaví výkresu`_ QElectroTech umožňuje stanovit dva různé typy obsahu v typu `textové buňky`_:

source: **Plain text**
cs: **Prostý text**

source: **Variable**
cs: **Proměnné**

source: QElectroTech works managing different database, the content of the `cells`_ are storage in the project database. QElectroTech provides the feature of defining the cell content in different languages, the cell content is defined in a cell value table. The content from the different `cells`_ of the `title block`_ are automatically displayed in the language defined.
cs: QElectroTech pracuje se správou jiné databáze, obsahem `buňky`_ jsou úložiště v databázi projektu. QElectroTech poskytuje funkce stanovení obsahu buňky v různých jazycích, obsah buňky je stanoven v tabulce hodnot buňky. Obsah z různých `buněk`_ `záhlaví výkresu`_ se automaticky zobrazí ve stanoveném jazyku.

source: The working language from QElectroTech is defined at **Setting > Configure QElectroTech**.
cs: Pracovní jazyk QElectroTechu je stanoven v **Nastavení > Nastavit QElectroTech**.

source: Add text to cell
cs: Přidání textu do buňky

source: Select the `cell`_ where the text should be introduced.
cs: Vyberte `buňku`_, do které má být text vložen.

source: Press **Edit** button from text field and the cell value PopUP window will be displayed.
cs: Stiskněte tlačítko **Upravit** z textového pole a zobrazí vyskakovací okno s hodnotou buňky.

source: Press the button **Add a line** to add a new row in the cell value table.
cs: Stiskněte tlačítko **Přidat řádek** pro přidání nového řádku do tabulky hodnot buňky.

source: Define the 2 letter code that identifies the language from the text at **Language** column.
cs: Stanovte dvojpísmenný kód, který určí jazyk textu ve sloupci **Jazyk**.

source: Define the text at **Text** column.
cs: Stanovte text ve sloupci **Text**.

source: Press **OK**
cs: Stiskněte **OK**

source: QElectroTech works according `ISO 639-1`_ norm. The text language is defined using 2 letter code which should be used at the language column from the cell value table.
cs: QElectroTech pracuje podle normy `ISO 639-1`_. Jazyk textu je stanoven pomocí dvojpísmenného kódu, který se má použít ve sloupci jazyka tabulky hodnot buňky.

source: Figure: QElectroTech title block editor, cell label PopUP window
cs: Obrázek: Vyskakovací okno s popiskem buňky záhlaví výkresu v QElectroTechu

source: Add variable to cell
cs: Přidání proměnné do buňky

source: A title block variable is the value of a project or folio property. At QElectroTech, a variable is called using the percent symbol before the variable name (``%{variable-name}``).
cs: Proměnná záhlaví výkresu je hodnota vlastnosti projektu nebo listu. V QElectroTechu se proměnná volá pomocí symbolu procenta před názvem proměnné (``%{název proměnné}``).

source: QElectroTech has some default variables that the user does not need to create (ex.: ``%{author}``, ``%{date}``, ``%{title}``, ``%{folio}``, ``%{projecttitle}``, etc.).
cs: QElectroTech má některé výchozí proměnné, které uživatel nemusí vytvořit (např.: ``%{author}``, ``%{date}``, ``%{title}``, ``%{folio}``, ``%{projecttitle}`` - čili přeloženo je to: ``%{autor}``, ``%{datum}``, ``%{název}``, ``%{list}``, ``%{název projektu}`` atd.).

source: QElectroTech also allows the user defining extra variables:
cs: QElectroTech také uživateli umožňuje stanovit další proměnné:

source: Go to **Project > Project properties > General** to define costumized project variables.
cs: Jděte na **Projekt > Vlastnosti projektu > Obecné** a stanovte vlastní proměnné projektu.

source: Go to **Edit > Folio properties > Title block informations > Costum** to define costumized folio variables.
cs: Jděte na **Úpravy > Vlastnosti listu > Informace záhlaví výkresů > Vlastní** a stanovte vlastní proměnné projektu.

source: QElectroTech allows that the cell has a **Label** for the variable.
cs: QElectroTech umožňuje, aby buňka měla **štítek** pro proměnnou.

source: To define the label:
cs: Pro stanovení štítku:

source: Select the `cell`_ where the variable should be introduced.
cs: Vyberte `buňku`_, do které má být proměnná vložena.

source: Click the button **Display a label** to introduce a label in the cell. Click on the button and go to variable definition if the **Label** should not be displayed.
cs: Klepněte na tlačítko **Zobrazit štítek** pro vložení štítku do buňky. Klepněte na tlačítko a jděte na definici proměnné, pokud by se **štítek** neměl zobrazit.

source: Figure: QElectroTech Title block text cell properties
cs: Obrázek: Vlastnosti buňky v záhlaví výkresu v QElectroTechu

source: Press **Edit** button from label field and the label value PopUP window will be displayed.
cs: Stiskněte tlačítko **Upravit** ze štítkového pole a zobrazí se vyskakovací okno s hodnotou buňky.

source: Figure: QElectroTech title block editor, cell value PopUP window
cs: Obrázek: Vyskakovací okno s hodnotou buňky v editoru záhlaví výkresu v QElectroTechu

source: Press the button **Add a line** to add a new row in the Label value table.
cs: Stiskněte tlačítko **Přidat řádek** pro přidání nového řádku do tabulky hodnot štítku.

source: To define the variable:
cs: Pro stanovení proměnné:

source: Define the 2 letter code that identifies the language from the text at **Language** column. Defining only one languaje is enough for default variables.
cs: Stanovte dvojpísmenný kód, který určí jazyk textu ve sloupci **Jazyk**. Pro výchozí proměnné stačí stanovit pouze jeden jazyk.

source: Define the variable at **Text** column. A variable is defined as ``%{variable-name}``. The default variables can be copied to clipboard at the right bottom Combo Box and pasted (``Ctrl + c``) in **Text** column cell.
cs: Stanovte proměnnou ve sloupci **Text**. Proměnná je stanovena jako ``% {název-proměnné}``. Výchozí proměnné lze zkopírovat do schránky v pravém dolním poli s rozbalovacím seznamem a vložit (``Ctrl + c``) do sloupce buňky **Text**.

source: For more information about default variables, refer to `default QElectroTech variables`_ section.
cs: Další informace o výchozích proměnných najdete v části k `proměnným v QElectroTechu`_.
