Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/column_width.po
Languages: cs

source: Colum width definition
cs: Stanovení šířky sloupce

source: The width from a `column`_ can only be defined from the column head, the top cell from the `drawing area`_ which gives the width value from the corresponding `column`_. The head from the `columns`_ is not displayed in the `folio`_, it is only displayed at `title block editor`_.
cs: Šířku `sloupce`_ lze stanovit pouze ze záhlaví sloupce, horní buňka z `kreslicí plochy`_, která udává hodnotu šířky odpovídajícího sloupce. Záhlaví `sloupců`_ se nezobrazí v `listu`_, zobrazí se pouze v `editoru záhlaví výkresu`_.

source: Double click on column head to display the column width PopUp window.
cs: Dvakrát klepněte na záhlaví sloupce pro zobrazení vyskakovacího okna pro šířku sloupce.

source: Figure: QElectroTech Title block column width PopUP window
cs: Obrázek: Vyskakovací okno pro šířku sloupce záhlaví výkresu v QElectroTechu

source: Select the click button corresponding to the desired units to define the column width (Absolute, relative to total, relative to remainding).
cs: Vyberte tlačítko klepnutí odpovídající požadovaným jednotkám a stanovte šířku sloupce (absolutní, relativní k celkovému, relativní ke zbývajícímu).

source: Define the width value.
cs: Stanovte hodnotu šířky.

source: Press **OK**.
cs: Stiskněte **OK**.

source: The global width from the `title block`_ has to be defined at QElectroTech, for this reason, defining one column width as remanding of 100% is recomended.
cs: Celková šířka `záhlaví výkresu`_ musí být stanovena v QElectroTechu, z tohoto důvodu se doporučuje stanovení šířky jednoho sloupce jako zbývající ze 100 %.

source: Figure: QElectroTech Title block
cs: Obrázek: Záhlaví výkresu v QElectroTechu

source: At the case that a remanding width is not desired, be sure that the global width from the `title block`_ matches with the sum of all column widths. At the case that the values are not matching, QElectroTech will display the `title block`_ as shown below; part of the title block header will be displayed in red and the width difference will be displayed.
cs: V případě, že není žádoucí zbývající šířka, ujistěte se, že celková šířka `záhlaví výkresu`_ odpovídá součtu šířek všech sloupců. V případě, že se hodnoty neshodují, QElectroTech zobrazí záhlaví výkresu, jak je znázorněno níže; část záhlaví výkresu se zobrazí červeně a zobrazí se rozdíl šířky.

source: Figure: QElectroTech Title block global width error
cs: Obrázek: Chyba celkové šířky záhlaví výkresu v QElectroTechu

source: At the case of using **Relative to remainding**, be sure that the value from the width is 100 %. Otherwise, spare area will appear in the `title block`_.
cs: V případě použití **Poměrná ke zbytku** se ujistěte, že hodnota šířky je 100 %. Jinak se v `záhlaví výkresu`_ zobrazí náhradní plocha.

source: Figure: QElectroTech Title block column width error
cs: Obrázek: Chyba šířky sloupce záhlaví výkresu v QElectroTechu
