Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/edition/logo.po
Languages: cs

source: Introduce a logo on the title block
cs: Vložení loga do záhlaví výkresu

source: Select the `cell`_ where the logo should be introduced.
cs: Vyberte `buňku`_, do které má být značka (logo) vložena.

source: Go to properties and choose **Logo** at **Cell type** Combo Box.
cs: Jděte do vlastností a v rozbalovací seznamu **Typ buňky** vyberte **Logo**.

source: Figure: QElectroTech Title block cell properties
cs: Obrázek: Vlastnosti buňky v záhlaví výkresu v QElectroTechu

source: Define the name of the `cell`_, if it is desired.
cs: V případě potřeby stanovte název `buňky`_.

source: Press the **Manage logo** button to display the logo manager PopUP window.
cs: Stiskněte tlačítko ``Spravovat loga`` pro zobrazení vyskakovacího okna správce značek (loga).

source: Figure: QElectroTech Title block logo manager PopUP window
cs: Obrázek: Vyskakovací okno správce log v záhlaví výkresu v QElectroTechu

source: Press the button **Add a logo** to display the file explorer PopUP window.
cs: Stiskněte tlačítko ``Přidat logo`` pro zobrazení vyskakovacího okna průzkumníka souborů.

source: Choose the SVG or Bitmap file with the desired logo and close the logo manager.
cs: Vyberte soubor SVG nebo bitmapu s požadovaným logem a zavřete správce log.

source: Choose the logo added previously at **Logo** Combo Box.
cs: Vyberte dříve přidané logo v rozbalovacím seznamu **Logo**.
