Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/conductor/properties/conductor_appearance.po
Languages: cs

source: Conductor appearance
cs: Vzhled vodiče

source: The color, type and width from the line of the schema that represents the conductor can be defined. A line can have a main color and, if desired, a secondary color.
cs: Barvu, typ a šířku čáry ve výkresu, která představuje vodič, lze stanovit. Čára může mít hlavní barvu a, je-li to požadováno, vedlejší barvu.

source: The secondary line is used when a dashes line with double color is desired.
cs: Vedlejší čára se používá, když je požadována přerušovaná čára s dvojitou barvou.

source: Figure: Conductor with red secundary color
cs: Obrázek: Vodič s červenou vedlejší barvou

source: Figure: Multiline conductor appearance
cs: Obrázek: Vzhled vícežilového vodiče

source: The different types of lines are: **Solid**, **Dashed** and **Dots and dasches**.
cs: Různé typy čar jsou: **Plná**, **Přerušovaná** a **Přerušovaná a tečkovaná**.

source: The possible colors are defined by the `RGB scale range`_.
cs: Možné barvy jsou stanoveny `rozsahem stupnice RGB`_.

source: The possible line thiknes are between 0.4 and 10 mm (0.4, 0.6, 0.8, 1.0, 1.2, 1.4, 1.6, ... , 10).
cs: Možné tloušťky čáry jsou mezi 0,4 a 10 mm (0,4, 0,6, 0,8, 1,0, 1,2, 1,4, 1,6 ... , 10).

source: QElectroTech provides the option to pre-define the appearance of conductor before starting to draw conductos at the folio. This feature increase the working eficiency and avoid defining the appearence conductor by conductors after their creation.
cs: QElectroTech poskytuje možnost předem stanovit vzhled vodiče před započetím kreslení vodičů na list. Tato funkce zvyšuje účinnost práce a umožňuje vyhnout se stanovení vzhledu vodičů vodič po vodiči po jejich vytvoření.

source: For more information about appearance pre-definition, refer to `folio properties`_ section.
cs: Další informace o stanovení vzhledu dopředu naleznete v části s `vlastnostmi listu`_.
