Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/conductor/properties/conductor_numbering.po
Languages: cs

source: Conductor numbering
cs: Číslování vodičů

source: QElectroTech allows an automatic codification of `conductors`_. This feature is very usefull for the creation of `reports`_, `conductor list`_, and for the identification of `conductors`_ at the physical systems and `schemas`_.
cs: QElectroTech umožňuje automatickou utřídění `vodičů`_. Tato funkce je velmi užitečná pro vytváření `odkazů`_, `seznamu vodičů`_ a pro rozpoznání vodičů ve fyzických systémech a `výkresech`_.

source: QElectroTech allows the definition of multiples auto numbering patterns. It also provides many flexibility on the creation of auto numbering patterns using text, variables and sequential numbers.
cs: QElectroTech umožňuje stanovit více vzorů automatického číslování. To také poskytuje mnoho pružnosti při vytváření vzorů automatického číslování pomocí textu, proměnné a pořadových čísel.

source: Figure: QElectroTech conductor auto numbering
cs: Obrázek: Automatické očíslování vodiče v QElectroTechu

source: Example
cs: Příklad

source: Taking the content from the image above:
cs: Převzetí obsahu z obrázku výše:

source: Code defined by `IEC 81346`_ norm.
cs: Kód stanovený normou `IEC 81346`_.

source: **W**: Guiding or transporting from one place to another.
cs: **W**: Vedení nebo přeprava z jednoho místa na druhé.

source: Alphanumeric code corresponding to the following coding:
cs: Alfanumerický kód odpovídající následujícímu kódování:

source: H: High voltage
cs: H: Vysoké napětí

source: D: Digital signal
cs: D: Digitální signál

source: A: Analog signal
cs: A: Analogový signál

source: @: Network
cs: @: Síť

source: Installation or functional unit to which the cable belongs (`schema`_ where the cable can be found).
cs: Instalační nebo funkční jednotka, ke které kabel patří (`výkres`_, kde lze kabel najít).

source: 001: Incoming plant
cs: 001: Přicházející plant

source: 002: Global auxiliary power
cs: 002: Celkový pomocný výkon

source: 003: Distribution Network
cs: 003: Distribuční síť

source: 004: instalation 1
cs: 004: Instalace 1

source: 005: installation 2
cs: 005: Instalace 2

source: Folio where the cable is represented.
cs: List, na němž je kabel znázorněn.

source: Cable number.
cs: Číslo kabelu.

source: For more information about how to define auto numbering patterns, refer to `project auto numbering properties`_ section.
cs: Další informace o tom, jak stanovit automatické číslovací vzory, naleznete v části `vlastnosti automatického číslování projektu`_.

source: For more information about how to manage the codification of conductors, refer to `create conductor`_ section.
cs: Další informace o tom, jak spravovat utřídění vodičů, naleznete v části k `vytvoření vodiče`_.
