Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/conductor/properties/conductor_type.po
Languages: cs

source: Conductor type
cs: Typ vodiče

source: Multiline conductor
cs: Vícežilový vodič

source: For `multiline conductors`_, QElectroTech allows defining many different parameters from the conductor. The parameters which can be defined are:
cs: Pro `vícežilové vodiče`_ umožňuje QElectroTech stanovit mnoho různých parametrů vodičů. Parametry, které lze stanovit, jsou:

source: Display parameters:
cs: Parametry zobrazení:

source: **Text size**: Size of the displayed text.
cs: **Velikost textu**: Velikost zobrazeného textu.

source: **Text formula**: To be used if a variable value is desired at the **Text** field during `conductor creation`_.
cs: **Vzorec textu**: Použije se, pokud je v poli **Text** během `vytváření vodiče`_ požadována hodnota proměnné.

source: **Text**: Text field content to be displayed at `folio`_.
cs: **Text**: Obsah textového pole, který se má zobrazit v `listu`_.

source: **Text color**: Font color to be displayed at `folio`_.
cs: **Barva textu**: Barva písma, která se má zobrazit v `listu`_.

source: Positioning and orientation from the displayed text at `folio`_, vertical and horizontal `conductors`_.
cs: Umístění a natočení v `listu`_ zobrazeného textu, svislé a vodorovné `vodiče`_.

source: Conductor properties:
cs: Vlastnosti vodiče:

source: **Function**: Variable from `conductor`_, it is used to define the wire phase (L1, L2, L3, N, etc.).
cs: **Funkce**: Proměnná `vodiče`_, používá se ke stanovení fáze drátu (L1, L2, L3, N atd.).

source: **Voltage / Protocol**: Variable from the `conductor`_, it is used to define the wire voltage (0v,230V,400V, 6kV, etc.) or the wires network protocol (IP).
cs: **Napětí/Protokol**: Proměnná `vodiče`_, používá se ke stanovení napětí drátu (0v, 230 V, 400V, 6 kV atd.) nebo protokolu drátové sítě (IP).

source: **Conductor color**: Variable from the `conductor`_, it is used to define the wire color.
cs: **Barva vodiče**: Proměnná `vodiče`_, používá se ke stanovení barvy drátu.

source: **Conductor section**: Variable from the `conductor`_, it is used to define the wire section.
cs: **Část vodiče**: Proměnná `vodiče`_, používá se ke stanovení části drátu.

source: **Cable**:
cs: **Kabel**:

source: **Bus**:
cs: **Sběrnice**:

source: Figure: Multiline conductor properties
cs: Obrázek: Vlastnosti vícežilového vodiče

source: Displaying the `conductor TAG (code)`_ at `multiline diagrams`_ is usual for an easily manage of the manufacturing, erection, commissioning and maintenance phase of the product.
cs: Zobrazení `TAG vodiče (kód)`_ ve `vícežilových diagramech`_ je obvyklé pro snadnou správu výroby, montáže, uvedení do provozu a fáze údržby výrobku.

source: QElectroTech allows an automatic conducto number definition for the text using the variable ``%autonum`` at the **Text formula** field. This field have to be defined at `Folio properties`_ before starting the `conductor creation`_.
cs: QElectroTech umožňuje automatické stanovení čísla vodiče pro text pomocí proměnné ``% autonum`` v poli **Textový vzorec**. Toto pole musí být stanoveno ve `vlastnostech listu`_ před zahájením `vytvoření vodiče`_.

source: Single line conductor
cs: Jednožilový vodič

source: For `single line conductors`_, the `conductors`_ are represented without any text infromation. Only the type of power system should be defined to have the correct symbol representation.
cs: U `jednožilových vodičů`_ jsou `vodiče`_ znázorněny bez jakékoli textové informace. Stanoven má být pouze typ systému napájení, aby měl správné znázornění značek.

source: QElectroTech allows the following options for `single line conductors`_:
cs: QElectroTech umožňuje pro `jednožilové vodiče`_ následující možnosti:

source: System with or without **Ground**
cs: Soustava s nebo bez **Uzemnění**

source: System with or without **Neutral**
cs: Soustava s nebo bez **Nulový**

source: **PEN** system, system where **Neutral** and **Ground** are the same wire.
cs: **PEN** systém, systém, kde **Nulový** a **Uzemnění** jsou stejné vodiče.

source: Systems with one, two or three phases
cs: Soustavy s jednou, dvěma nebo třemi fázemi

source: Figure: Single line conductor properties
cs: Obrázek: Vlastnosti jednožilového vodiče
