Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/basics/help.po
Languages: cs

source: QElectroTech help menu
cs: Nabídka s nápovědou ke QElectroTechu

source: QElectroTech has been designed with some tools which help the user and makes easier the searching of information. All those tools can be found at **Help** menu from `menu bar`_.
cs: QElectroTech byl navržen s některými nástroji, které pomáhají uživateli, a usnadňují vyhledávání informací. Všechny tyto nástroje najdete v `hlavní nabídce`_ **Nápověda**.

source: Figure: Help menu QElectroTech
cs: Obrázek: Hlavní nabídka s nápovědou ke QElectroTechu

source: Tooltips
cs: Nástrojové rady

source: To support the user, tooltips are displayed when the mouse arrow is placed on an icon from the `toolbars`_. A tooltip is a short message which defines the action corresponding to the icon.
cs: Pro podpoření uživatele jsou popisy nástrojů zobrazeny, když je šipka myši umístěna na ikonu v `panelu nástrojů`_. Nástrojová rada je krátká zpráva, která blíže určuje činnost odpovídající ikoně.

source: QElectroTech also allows the display from tooltips, or short descrition panels, at many different areas and objets from the main window. These panels are not diplayed automatically with the placement of the mouse arrow on the object or area.
cs: QElectroTech také umožňuje zobrazení nástrojových rad, nebo panelů s krátkými popisy, k mnoha různým oblastem a předmětům hlavního okna. Tyto panely se nezobrazují automaticky při umístění šipky myši na předmět nebo plochu.

source: Select **Help > What's this?** menu item.
cs: Vyberte položku nabídky **Nápověda > Co je to?**.

source: Press on the object or area to display the description panel.
cs: Stiskněte předmět nebo oblast pro zobrazení panelu s popisem.

source: Figure: Message which appears at the workspace
cs: Obrázek: Zpráva, která se zobrazí v pracovní ploše

source: To increase the working eficiency, the description panel can also be displayed using keyboard shortcut. The user does not need to resort to the **Help** menu.
cs: Pro zvýšení účinnosti práce může být panel s popisem zobrazen také pomocí klávesové zkratky. Uživatel se nemusí uchýlit k nabídce **Nápověda**.

source: Press ``shift + f1``.
cs: Stiskněte ``Shift + F1``.

source: The tool **What's this?** does not give the description from everyting, it gives only the description for the different type of collections (`title blocks`_ and `elements`_), the `workspace`_, `project`_ area and a few objects and areas more.
cs: Nástroj **Co je to?** neposkytuje popis čehokoli, poskytuje pouze popis pro různé typy sbírek (`záhlaví výkresu`_ a `prvky`_), `pracovní plocha`_, oblast `projektu`_ a k několika dalším předmětům a plochám.

source: About QElectroTech
cs: O programu QElectroTech

source: Many information related to QElectroTech can be found at the application without searching on Internet. Everybody who launch the application can find the license text, version of the application launched, developers and collaborators.
cs: Mnoho informací týkajících se QElectroTechu najdete v programu bez vyhledávání na internetu. Každý, kdo program spustí, může najít text licence, verzi spuštěné aplikace, vývojáře a spolupracovníky.

source: Select **Help > About QElectroTech** menu item to display the PopUP window with the basic information from QElectroTech project.
cs: Vyberte položku nabídky **Nápověda > O QElectroTechu** pro zobrazení vyskakovacího okna se základními informacemi o projektu QElectroTech.

source: Online Manual
cs: Příručka na internetu

source: **Help** menu can address the user to the official online documentation.
cs: Nabídka **Nápověda** může uživatele přesměrovat na oficiální internetovou dokumentaci.

source: Select **Help > Online Manual** menu item to open the official QEletroTech online documentation at default browser.
cs: Vyberte položku nabídky **Nápověda > Internetová příručka** pro otevření oficiální internetové dokumentace ke QEletroTechu ve výchozím prohlížeči.

source: When the application is active on the computer, the user can also open the online manual at default browser using keyboard shortcut.
cs: Když je aplikace v počítači spuštěna, uživatel může ve výchozím prohlížeči pomocí klávesové zkratky otevřít i internetovou příručku.

source: Press ``f1`` to open the official online manual on the browser.
cs: Stiskněte klávesu ``F1`` pro otevření oficiální příručky na internetu v prohlížeči.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.

source: Youtube Channel
cs: Kanál Youtube

source: Many different video tutorials about QElectroTech can be found on Internet. **Help** menu can address the user to the official `Youtube`_ channel of the project.
cs: Mnoho různých obrazových návodů ke QElectroTechu najdete na internetu. Nabídka **Nápověda** může uživatele přesměrovat na oficiální `Youtube`_ kanál projektu.

source: Select **Help > Youtube Channel** menu item to open the QEletroTech `Youtube`_ channel at default browser.
cs: Vyberte položku nabídky **Nápověda > Kanál Youtube** pro otevření kanálu pro QEletroTech u služby `Youtube`_ ve výchozím prohlížeči.

source: Support the project
cs: Podpořte projekt

source: If the user is satisfied with the work already made by the developer team from QElectroTech and he wants to help the project with an economical donation, **Help** menu can address the user to the official `PayPal`_ account of the project.
cs: Pokud je uživatel spokojen s vývojářským týmem již provedenou prací na QElectroTechu a chce projektu pomoci finančním darem, nabídka **Nápověda** uživatele může přesměrovat na oficiální `PayPal`_ účet projektu.

source: Select **Help > Support the project with a donation** menu item to open the official `PayPal`_ account from QEletroTech at default browser.
cs: Vyberte položku **Nápověda > Podpořte projekt darem** pro otevření oficiálního účtu u služby `PayPal`_ QEletroTechu ve výchozím prohlížeči.

source: About Qt
cs: O Qt

source: QElectroTech has been designed using `Qt`_ framework and widget toolkit. **Help** menu allows going to the official web from `Qt`_ project without the need of searching on Internet.
cs: QElectroTech byl navržen s použitím systému a nástrojové sady doplňků `Qt`_. Nabídka **Nápověda** umožňuje přejít na oficiální stránku projektu `Qt`_ bez potřeby hledání na internetu.

source: Select **Help > About Qt** menu item to open the offical web from `Qt`_ at default browser.
cs: Vyberte položku nabídky **Nápověda > O Qt** a otevřete oficiální stránku `Qt`_ ve výchozím prohlížeči.
