Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/basics/launch_linux.po
Languages: cs_cz

source: Launch QElectroTech on Linux
cs_cz: Spuštění QElectroTechu v Linuxu

source: After installation, Linux allows the user launching applications from many different ways. Below, the most common ways are explained.
cs_cz: Po instalaci Linux uživateli umožňuje spouštět aplikace mnoha různými způsoby. Níže jsou vysvětleny nejběžnější způsoby.

source: Launch QElectroTech from terminal
cs_cz: Spuštění QElectroTechu v terminálu

source: To launch QElectroTech using the terminal, the command to be used is:
cs_cz: Pro spuštění QElectroTechu pomocí terminálu je třeba použít následující příkaz:

source: The command mentioned above blocks the terminal for other processes. If the terminal should be available for other processes, the command to launch QElectroTech is:
cs_cz: Výše uvedený příkaz blokuje terminál pro další procesy. Pokud by měl být terminál dostupný pro jiné procesy, příkaz pro spuštění QElectroTechu je:

source: If the command is not working, list the applications installed and check the name with which QElectroTech has been installed.
cs_cz: Pokud příkaz nepracuje, uveďte nainstalované aplikace a zkontrolujte název, pod kterým byl QElectroTech nainstalován.

source: Ubuntu command: ``$ apt list --installed``
cs_cz: Příkaz pro Ubuntu: ``$ apt list --installed``

source: Figure: Splash screen
cs_cz: Obrázek: Úvodní obrazovka

source: Launch QElectroTech from applications menu
cs_cz: Spuštění QElectroTechu z nabídky programů

source: As Windows, Linux operative systems allow the user to launch applications from menus and icons. Where to go depends on the theme and distribution used. Below, some possibilities according some configurations are mentioned.
cs_cz: Operační systémy Linux, stejně jako Windows, umožňují uživateli spouštět aplikace pomocí nabídek a ikon. Kam jít závisí na použitém tématu a distribuci. Níže jsou zmíněny některé možnosti podle některých nastavení.

source: Unity theme: The icon appears at the launcher bar.
cs_cz: Téma Unity: Ikona se zobrazí na liště spouštěče.

source: Gnome shell: The icon appears at **[Menu]**, with the rest of applications.
cs_cz: Gnome shell: Ikona se objeví v **[Nabídce]**, se zbytkem programů.

source: Gnome Classic: QElectroTech can be started from **Applications > Graphics > QElectroTech**.
cs_cz: Gnome Classic: QElectroTech lze spustit z **Aplikace > Grafika > QElectroTech**.

source: KDE: QElectroTech can be started from **[Menu]** at **Graphics > QElectroTech**.
cs_cz: KDE: QElectroTech lze spustit z **[Nabídky]** v **Grafika > QElectroTech**.

source: Once QElectroTech has been launched, the main window looks as follow:
cs_cz: Po spuštění QElectroTechu vypadá hlavní okno následovně:

source: Figure: Main window QElectroTech
cs_cz: Obrázek: Hlavní okno QElectroTechu
