Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/basics/quit.po
Languages: cs_cz

source: Quit QElectroTech
cs_cz: Ukončit QElectroTech

source: The user can quit QElectroTech at anytime. The user does not need to `close the project`_ before clossing the application.
cs_cz: Uživatel může program QElectroTech kdykoli ukončit. Uživatel nemusí `projekt zavřít`_ před zavřením aplikace.

source: If the current work wants to be saved before closing the project, refer to `save project`_ section. Even so, QElectroTech displays an automatic message to save the current job if any modification has been created.
cs_cz: Pokud má být nynější práce uložena před zavřením projektu, podívejte se na část `uložit projekt`_. I tak QElectroTech zobrazuje automatickou zprávu pro uložení nynější úlohy, pokud byla vytvořena nějaká změna.

source: Figure: QElectroTech Save message
cs_cz: Obrázek: Zpráva o uložení v QElectroTechu

source: As a large amoung of applications which has been developed using `Qt`_, QElectroTech can be closed from the close tab |close_tab| which can be found at top right from main window, from `menu bar`_ or using the corresponding keyboard shortcut.
cs_cz: Jako velké množství aplikací, které byly vyvinuty pomocí `Qt`_, QElectroTech lze zavřít z karty pro zavření |close_tab|, kterou lze najít v hlavním okně vpravo nahoře, pomocí `hlavní nabídky`_ nebo pomocí odpovídající klávesové zkratky.

source: Quit QElectroTech from menu bar
cs_cz: Ukončení QElectroTechu pomocí hlavní nabídky

source: Select **File > Quit** menu item to quit QElectroTech.
cs_cz: Vyberte položku nabídky **Soubor > Ukončit** pro ukončení QElectroTechu.

source: Figure: QElectroTech File menu
cs_cz: Obrázek: Nabídka pro soubor v QElectroTechu

source: Quit QElectroTech using keyboard shortcut
cs_cz: Ukončení QElectroTechu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs_cz: QElectroTech umožňuje pro zvýšení pracovní výkonnosti používat klávesovou zkratku.

source: Press ``Ctrl + q`` to quit QElectroTech.
cs_cz: Stiskněte ``Ctrl + q`` pro ukončení QElectroTechu.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs_cz: Další informace o klávesových zkratkách QElectroTechu najdete v části `hlavní nabídka`_.
