Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/copy.po
Languages: cs

source: Copy object
cs: Kopírování předmětu

source: QElectroTech allows copying objects (`element`_, `conductor`_, `text field`_, `basic object`_ and `picture`_) to `paste`_ them at the same `folio`_ or at different `folio`_ and/or `project`_ later.
cs: QElectroTech umožňuje kopírování předmětů (`prvek`_, `vodič`_, `textové pole`_, `základní předmět`_ a `obrázek`_) pro jejich `vložení`_ ve stejném `listu`_, nebo v jiném listu a/nebo později v jiném `projektu`_.

source: Multiples objects can be copied at the same time `selecting multiple objects`_.
cs: Ve stejnou dobu lze po `vybrání více předmětů`_ kopírovat více předmětů.

source: The `element`_ would suffer data losses if the intention is to `paste`_ it at different `project`_.
cs: `Prvek`_ by utrpěl ztrátu dat, pokud je záměrem `vložit`_ jej v jiném `projektu`_.

source: Copying objects can be done from `menu bar`_, `toolbar`_, by right click on the object and using the corresponding keyboard shortcut.
cs: Kopírování předmětů lze provádět přes `hlavní nabídku`_, `panel nástrojů`_, klepnutím pravým tlačítkem na předmět a pomocí odpovídající klávesové zkratky.

source: Copy object from menu bar
cs: Kopírování předmětu přes hlavní nabídku

source: `Select the object/s`_ which should be copied.
cs: `Vyberte předmět(y)`_, který se má zkopírovat.

source: Select **Edit > Copy** menu item to copy the object.
cs: Pro kopírování předmětu vyberte položku nabídky **Úpravy > Kopírovat**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Copy object from toolbar
cs: Kopírování předmětu přes pruh s nástroji

source: Select the icon |edit-copy| from `toolbar`_ to copy the object.
cs: Pro kopírování předmětu v `panelu nástrojů`_ vyberte ikonu |edit-copy|.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**.

source: Copy object by right click
cs: Kopírování předmětu klepnutím pravým tlačítkem myši

source: Right click on the object which should be copied.
cs: Klepněte pravým tlačítkem myši na předmět, který se má zkopírovat.

source: Select the option **Copy** to copy the object.
cs: Pro kopírování předmětu vyberte volbu **Kopírovat**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Copy object using keyboard shortcut
cs: Kopírování předmětu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + c`` to copy the object.
cs: Pro kopírování předmětu stiskněte ``Ctrl + c``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
