Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/cut.po
Languages: cs

source: Cut object
cs: Vyjmutí předmětu

source: QElectroTech allows cutting objects (`element`_, `conductor`_, `text field`_, `basic object`_ and `picture`_) to `paste`_ them at the same `folio`_ or at different `folio`_ and/or `project`_ later.
cs: QElectroTech umožňuje vyjmutí předmětů (`prvek`_, `vodič`_, `textové pole`_, `základní předmět`_ a `obrázek`_) pro jejich `vložení`_ ve stejném `listu`_, nebo v jiném listu a/nebo později v jiném `projektu`_.

source: Multiples objects can be cut at the same time `selecting multiple objects`_.
cs: Ve stejnou dobu lze po `vybrání více předmětů`_ vyjmout více předmětů.

source: The `element`_ would suffer data losses if the intention is to `paste`_ it at different `project`_.
cs: `Prvek`_ by utrpěl ztrátu dat, pokud je záměrem `vložit`_ jej v jiném `projektu`_.

source: Cutting objects can be done from `menu bar`_, `toolbar`_, by right click on the object and using the corresponding keyboard shortcut.
cs: Vyjmutí předmětů lze provádět přes `hlavní nabídku`_, `panel nástrojů`_, klepnutím pravým tlačítkem na předmět a pomocí odpovídající klávesové zkratky.

source: Cut object from menu bar
cs: Vyjmutí předmětu přes hlavní nabídku

source: `Select the object/s`_ which should be cut.
cs: `Vyberte předmět(y)`_, který se má vyjmout.

source: Select **Edit > Cut** menu item to cut the object.
cs: Pro vyjmutí předmětu vyberte položku nabídky **Úpravy > Vyjmout**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Cut object from toolbar
cs: Vyjmutí předmětu přes pruh s nástroji

source: Select the icon |edit-cut| from `toolbar`_ to cut the object.
cs: Pro vyjmutí předmětu v `panelu nástrojů`_ vyberte ikonu |edit-cut|.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**.

source: Cut object by right click
cs: Vyjmutí předmětu klepnutím pravým tlačítkem myši

source: Right click on the object which should be cut.
cs: Klepněte pravým tlačítkem myši na předmět, který se má vyjmout.

source: Select the option **Cut** to cut the object.
cs: Pro vyjmutí předmětu vyberte volbu **Vyjmout**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Cut object using keyboard shortcut
cs: Vyjmutí předmětu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + x`` to cut the object.
cs: Pro vyjmutí předmětu stiskněte ``Ctrl + x``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
