Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/delete.po
Languages: cs

source: Delete object
cs: Smazání předmětu

source: Choosing the correct `element`_, `conductor`_, `text field`_, etc. from the beginning is always nice, even so, QElectroTech allows deleting all type of object that can be add to the folios (`element`_, `conductor`_, `text field`_, `basic object`_ and `picture`_).
cs: Výběr správného `prvku`_, `vodiče`_, `textového pole`_ atd. od začátku je vždy hezký, i přesto umožňuje QElectroTech smazat všechny druhy předmětů, které lze přidat do listů (prvek, vodič, textové pole, `základní předmět`_ a `obrázek`_).

source: Multiples objects can be deleted at the same time `selecting multiples object`_.
cs: Ve stejnou dobu lze po `vybrání více předmětů`_ smazat více předmětů.

source: Deleting objects can be done from `menu bar`_, `toolbar`_, by right click on the object and using the corresponding keyboard shortcut.
cs: Smazání předmětů lze provádět přes `hlavní nabídku`_, `panel nástrojů`_, klepnutím pravým tlačítkem na předmět a pomocí odpovídající klávesové zkratky.

source: Delete object from menu bar
cs: Smazání předmětu přes hlavní nabídku

source: `Select the object/s`_ which should be delete.
cs: `Vyberte předmět(y)`_, který se má smazat.

source: Select **Edit > Delete** menu item to delete the object.
cs: Pro smazání předmětu vyberte položku nabídky **Úpravy > Smazat**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Delete object from toolbar
cs: Smazání předmětu přes pruh s nástroji

source: `Select the object/s`_ which should be deleted.
cs: `Vyberte předmět(y)`_, který se má smazat.

source: Select the icon |edit-delete| from `toolbar`_ to delete the object.
cs: Pro smazání předmětu v `panelu nástrojů`_ vyberte ikonu |edit-delete|.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**.

source: Delete object by right click
cs: Smazání předmětu klepnutím pravým tlačítkem myši

source: Right click on the object which should be deleted.
cs: Klepněte pravým tlačítkem myši na předmět, který se má smazat.

source: Select the option **Delete** to delete the object.
cs: Pro smazání předmětu vyberte volbu **Smazat**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Delete object using keyboard shortcut
cs: Smazání předmětu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``delete`` to delete the object.
cs: Pro smazání předmětu stiskněte klávesu ``Delete``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
