Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/multiple_paste.po
Languages: cs

source: Multiple paste
cs: Vícenásobné vložení

source: For making more eficient the schema creation, QElectroTech provides the feature multiple paste. This feature allows `copying`_ and `pasting`_ one or more objects automating some object definition actions.
cs: Pro účinnější vytváření výkresů poskytuje QElectroTech funkci vícenásobného vložení. Tato funkce umožňuje `kopírování`_ a `vkládání`_ jednoho nebo více předmětů automatizujících některé činnosti stanovení předmětu.

source: Figure: QElectroTech multiple paste
cs: Obrázek: Vícenásobné vložení v QElectroTechu

source: As a difference to the standard `copy`_ and `paste`_ feature, the multiple paste feature provides the following options:
cs: Na rozdíl od běžné funkce pro `kopírování`_ a `vložení`_ funkce vícenásobného vložení poskytuje následující možnosti:

source: `Copy`_ and `paste`_ an onject (`element`_, `conductor`_, `text field`_, etc.) multiple times in one action.
cs: `Zkopírovat`_ a `vložit`_ předmět (`prvek`_, `vodič`_, `textové pole`_, atd.) vícekrát v jednom kroku.

source: Use QElectroTech auto-conection feature for `element terminals`_ which are at the same horizontal or vertical line.
cs: Použijte funkci automatického připojení v QElectroTechu pro `svorky prvku`_, které jsou ve stejném vodorovném nebo svislém řádku.

source: Self-numbering of the copied `element/s`_, the `standard copy`_ feature does not allow using auto-numbering patterns.
cs: U automatického číslování zkopírovaného `prvku`_ (zkopírovaných prvků) funkce pro `standardní kopírování`_ neumožňuje použití vzorů automatického číslování.

source: Self-numbering of the copied/created `conductor/s`_, the `standard copy`_ feature does not allow using auto-numbering patterns.
cs: U automatického číslování zkopírovaného/vytvořeného `vodiče`_ (zkopírovaných vodičů) funkce pro `standardní kopírování`_ neumožňuje použití vzorů automatického číslování.

source: To copy and paste multiple times one or more object:
cs: Pro kopírování a vložení vícekrát jednoho nebo více předmětů:

source: `Select the object/s`_ which should be copied.
cs: `Vyberte předmět(y)`_, který se má zkopírovat.

source: Right click on the selected object/s.
cs: Klepněte pravým tlačítkem myši na vybraný předmět(y).

source: Figure: QElectroTech element right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši na prvek v QElectroTechu

source: Select the option **Multiple paste** to display the multiple paste PopUP window.
cs: Pro zobrazení vyskakovacího okna pro vícenásobné vložení vyberte volbu **Vícenásobné vložení**.

source: Figure: QElectroTech multiple paste PopUP window
cs: Obrázek: Vyskakovací okno pro vícenásobné vložení v QElectroTechu

source: Define the ``X`` and ``Y`` offset between original and copy/copies.
cs: Stanovte posun ``X`` a ``Y`` mezi originálem a kopií/kopiemi.

source: Define the number of copies desired.
cs: Stanovte požadovaný počet kopií.

source: Click the desired options about `auto-connection`_, `self-numebering of elements`_ and `self-numebering of conductors`_.
cs: Klepněte na požadované volby pro `automatické připojení`_, `automatické číslování prvků`_ a `automatické číslování vodičů`_.

source: Press **OK** Button to close the multiple paste PopUP window and create the copies.
cs: Pro zavření vyskakovacího okna pro vícenásobné vložení a vytvoření kopií stiskněte tlačítko **OK**.
