Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/paste.po
Languages: cs

source: Paste object
cs: Vložení předmětu

source: QElectroTech allows pasting objects (`element`_, `conductor`_, `text field`_, `basic object`_ and `picture`_) which has already been `copied`_ or `cut`_ at the same `folio`_ or at different `folio`_ and/or `project`_.
cs: QElectroTech umožňuje vložení předmětů (`prvek`_, `vodič`_, `textové pole`_, `základní předmět`_ a `obrázek`_), jež již byly `zkopírovány`_ nebo `vyjmuty`_ ve stejném `listu`_, nebo v jiném listu a/nebo `projektu`_.

source: Multiples objects can be pasted at the same time `copying`_ or `cutting`_ multiple objects.
cs: Ve stejnou dobu lze po `zkopírování`_ nebo `vyjmutí`_ vložit více předmětů.

source: The `element`_ would suffer data losses if the intention is to paste it at different `project`_.
cs: `Prvek`_ by utrpěl ztrátu dat, pokud je záměrem vložit jej v jiném `projektu`_.

source: Pasting objects can be done from `menu bar`_, `toolbar`_, by right click at the `workspace`_ and using the corresponding keyboard shortcut.
cs: Vložení předmětů lze provádět přes `hlavní nabídku`_, `panel nástrojů`_, klepnutím pravým tlačítkem v `pracovní ploše`_ a pomocí odpovídající klávesové zkratky.

source: Paste object from menu bar
cs: Vložení předmětu přes hlavní nabídku

source: Select **Edit > Paste** menu item to paste at the active `folio`_ an object `copied`_ or `cut`_ previously.
cs: Pro vložení předtím `zkopírovaného`_ nebo `vyjmutého`_ předmětu do činného `listu`_ vyberte položku nabídky **Úpravy > Vložit**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Paste object from toolbar
cs: Vložení předmětu přes pruh s nástroji

source: Select the icon |edit-paste| from `toolbar`_ to paste at the active `folio`_ an object `copied`_ or `cut`_ previously.
cs: Pro vložení předtím `zkopírovaného`_ nebo `vyjmutého`_ předmětu do činného `listu`_ vyberte v `panelu nástrojů`_ ikonu |edit-paste|.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**.

source: Paste object by right click
cs: Vložení předmětu klepnutím pravým tlačítkem myši

source: Right click at the `workspace`_ area where the object should be pasted.
cs: Klepněte pravým tlačítkem myši na oblast v `kreslicí ploše`_, kde se má předmět vložit.

source: Select the option **Paste Here** to paste an object `copied`_ or `cut`_ previously.
cs: Pro vložení předtím `zkopírovaného`_ nebo `vyjmutého`_ předmětu vyberte volbu **Vložit zde**.

source: Figure: QElectroTech right click PopUP window
cs: Obrázek: Vyskakovací okno po klepnutí pravým tlačítkem myši v QElectroTechu

source: Paste object using keyboard shortcut
cs: Vložení předmětu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + v`` to paste at the active `folio`_ an object `copied`_ or `cut`_ previously.
cs: Pro vložení předtím `zkopírovaného`_ nebo `vyjmutého`_ předmětu do činného `listu`_ stiskněte ``Ctrl + v``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
