Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/table.po
Languages: cs

source: Insert table
cs: Vložení tabulky

source: QElectorTech 0.7 does not have any `tool`_ or `menu`_ item which creates tables with the number of rows and columns desired automatically. QElectroTech allows importing HTML text, this is the way to create tables.
cs: QElectorTech 0.7 nemá žádný `nástroj`_ nebo položku `nabídky`_, která by automaticky vytvářela tabulky s požadovaným počtem řádků a sloupců. QElectroTech umožňuje zavést text HTML. Toto je způsob vytváření tabulky.

source: Select icon **Add textfield** |textfield| from the `toolbar`_.
cs: Pro přidání **textového pole** v `panelu nástrojů`_ vyberte ikonu |textfield|.

source: Click on the area from the `workspace`_ where the table should be created.
cs: Klepněte na oblast v `pracovní ploše`_, kde se má tabulka vytvořit.

source: Right click on text field and choose **Edit the text field** option.
cs: Klepněte pravým tlačítkem myši na textové pole a vyberte volbu **Upravit textové pole**.

source: Figure: QElectroTech text field option
cs: Obrázek: Volba pro textové pole v QElectroTechu

source: Choose the **source** tab from the `text field editor`_.
cs: V `editoru textového pole`_ vyberte kartu **Zdroj**.

source: Figure: Source tab text field editor
cs: Obrázek: Karta se zdrojem v editoru textového pole

source: Copy the ``html`` code generated by the HTML Table Generator.
cs: Zkopírujte kód ``html`` vytvořený tvůrcem tabulky HTML.

source: Choose the **Rich Text** tab from the `text field editor`_.
cs: V `editoru textového pole`_ vyberte kartu **Formátovaný text**.

source: Figure: Rich text tab text field editor
cs: Obrázek: Karta s formátovaným textem v editoru textového pole

source: Fill the headers and cells with the corresponding information.
cs: Naplňte záhlaví a buňky odpovídajícími údaji.

source: Press **OK** button and the table will be created at the `workspace`_.
cs: Stiskněte tlačítko **OK** a tabulka se vytvoří v `pracovní ploše`_.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Add**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Přidání**.

source: The table can be `moved`_ and `rotated`_ over the folio area like a `text field`_, it is a `text field`_ object.
cs: Tabulka může být `přesunuta`_ a `otočena`_ přes oblast listu jako `textové pole`_. Jedná se o předmět s textovým polem.

source: Many different HTML Table Generator can be found on interned or can be installed at the computer, an online option is:
cs: Na internetu lze nalézt noho různých tvůrců tabulek HTML. Nebo mohou být nainstalováni v počítači. Internetovou možností je:
