Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/element/element_add.po
Languages: cs

source: Add element
cs: Přidání prvku

source: To add an `element`_ to the `workspace`_:
cs: Pro přidání `prvku`_ do `pracovní plochy`_:

source: Select `auto numbering pattern`_ at the `Auto numbering selection panel`_.
cs: Vyberte `vzor automatického číslování`_ v `panelu pro výběr automatického číslování`_.

source: Figure: QElectroTech Auto numbering selection panel
cs: Obrázek: Panel pro výběr automatického číslování v QElectroTechu

source: If the `Auto numbering selection panel`_ is not displayed, it can be displayed from **Settings > Display > Auto numbering selection**.
cs: Pokud se `panel pro výběr automatického číslování`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Výběr automatického číslování**.

source: Search the `element`_ at the collection panel.
cs: `Prvek`_ vyhledejte v panelu se sbírkou.

source: Left Click on the desired `element`_. Without releasing move the mouse to the `workspace`_ area, onece the mouse is at the `workspace`_ it can be released.
cs: Klepněte levým tlačítkem myši na požadovaný `prvek`_. Bez uvolnění myš přesuňte na oblast `pracovní plochy`_. Jakmile je myš v pracovní ploše, může být tlačítko uvolněno.

source: Search for the desired element position and left clik on the place to add the `element`_, multiples `elements`_ can be added with multiple clicks at different places.
cs: Vyhledejte požadovanou polohu prvku a klepněte levým tlačítkem myši na místo pro přidání `prvku`_. Více `prvků`_ lze přidat několika klepnutími na různých místech.

source: Press ``esc`` to finish the adding action.
cs: Stiskněte ``Esc`` pro dokončení kroku.

source: Select **Settings > Display > Collections** menu item to display the collections panel.
cs: Pro zobrazení panelu se sbírkami vyberte položku nabídky **Nastavení > Zobrazení > Sbírky**.
