Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/what_*.po
Languages: is

source: What is an element?
is: Co je to prvek?

source: An element is an object wich contains information:
is: Prvek je předmět, který obsahuje informace:

source: Graphical representation information, symbol displayed at the schema.
is: Údaje o obrazovém znázornění, značka zobrazená ve výkresu.

source: Element data such element position in the poject, article number, manufacturer, supplier, link to any other element from the project, etc.
is: Data prvku, jako jsou poloha prvku v projektu, číslo článku, výrobce, dodavatel, odkaz na jakýkoli jiný prvek v projektu atd.

source: Figure: QElectroTech thermal circuit breaker element
is: Obrázek: Prvek tepelného jističe v QElectroTechu

source: An element is an object which function is to reduce the engineering work. Working with elements reduce the time and work necessary for the creation of schemas, Bill Of Materials (BOM) and many other types of reports such terminal lists, I/O lists, etc.
is: Prvek je předmět, jehož funkcí je omezit rozsah inženýrské práce. Práce s prvky zkracuje čas a zmenšuje velikost práce nezbytné pro tvorbu výkresů, kusovníků (BOM) a mnoha dalších druhů výpisů, jako jsou seznamy svorek, seznamy vstupů/výstupů atd.

source: The element can be clasified at different families:
is: Prvek lze zařadit do různých rodin:

source: `Simple`_
is: `Jednoduchý`_

source: `Master`_
is: `Nadřízený`_

source: `Slave`_
is: `Podřízený`_

source: `Reference folio following`_
is: `Odkaz na následující list`_

source: `Previous reference folio`_
is: `Odkaz na předchozí list`_

source: `Terminal block`_
is: `Svorkovnice`_

source: The graphical representation information characteristics are the same for all families. The element data properties fields and the possible interloking options are diferent between families.
is: Vlastnosti údajů o obrazovém znázornění jsou stejné pro všechny rodiny. Pole s vlastnostmi dat prvku a možné možnosti vzájemného blokování se mezi rodinami liší.
