Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/properties/folio_title_block.po
Languages: cs

source: Title block properties section
cs: Část s vlastnostmi záhlaví výkresu

source: The title block section from the `folio properties`_ is the section used to define the `title block`_ template used at the `folio`_. The folio variables can also be managed from this section.
cs: Část pro záhlaví výkresu ve `vlastnostech listu`_ je část použitá ke stanovení vzoru `záhlaví výkresu`_ použitého na `list`_. Proměnné listu lze spravovat také v této části.

source: To reduce the creation time, QElectroTech allows creating some pre-setting for all future folios that will be created in the project. The folio variable values and the `folio title block`_ can be prefedined at the project properties. For more information about how to pre-define folio properties, refert to `project properties`_ section.
cs: Ke zkrácení doby vytvoření QElectroTech umožňuje vytvořit přednastavení pro všechny budoucí listy, které budou v projektu vytvořeny. Hodnoty proměnných listu a `záhlaví výkresu listu`_ lze předem nastavit ve vlastnostech projektu. Další informace o tom, jak předem stanovit vlastnosti listu naleznete v části `vlastnosti projektu`_.

source: The title block section is organized on three different areas: title block selection area, main variable tab and costum variable tab.
cs: Část pro záhlaví výkresu je rozdělena do tří různých oblastí: oblast pro výběr záhlaví výkresu, karta s hlavní proměnnou a karta s vlastní proměnnou.

source: Title block selection area
cs: Oblast pro výběr záhlaví výkresu

source: The title block selection area is used to defne the `folio title block`_. The actions that can be managed from this section are:
cs: Oblast pro výběr záhlaví výkresu se používá ke stanovení `záhlaví výkresu listu`_. Činnosti, které lze spravovat v této části, jsou:

source: Select the `folio title block`_ from the `project title block collection`_.
cs: Ve `sbírce záhlaví výkresů v projektu` vyberte `záhlaví výkresu listu`_.

source: Select the position of the title block in the folio, bottom |titleblock-bottom| or right |titleblock-right| side.
cs: Vyberte polohu záhlaví výkresu v listu, dole |titleblock-bottom| nebo na pravé straně |titleblock-right|.

source: Edit the `title block`_ pressing the button |edit-rename| and choosing the option **Edit this template**.
cs: Upravte `záhlaví výkresu`_ stisknutím tlačítka |edit-rename| a výběrem volby **Upravit tento vzor**.

source: Duplicate the `title block`_ in the `project title block collection`_ pressing the button |edit-rename| and choosing the option **Duplicate and edit this template**.
cs: Zdvojte `záhlaví výkresu`_ ve `sbírce záhlaví výkresů v projektu`_ stisknutím tlačítka |edit-rename| a výběrem volby **Zdvojit a upravit tento vzor**.

source: Figure: Folio title block selection area
cs: Obrázek: Oblast pro výběr záhlaví výkresu v listu

source: For more information about QEelctroTech title block, refer to `title block`_ section.
cs: Další informace o záhlaví výkresu v QElectroTechu najdete v části `záhlaví výkresu`_.

source: Main folio properties tab
cs: Karta s hlavními vlastnostmi listu

source: The **Main** tab provides thes default folio variables.
cs: **Hlavní** karta poskytuje výchozí proměnné listu.

source: Figure: Folio title block main tab
cs: Obrázek: Hlavní karta záhlaví výkresu v listu

source: The default folio variables are:
cs: Výchozí proměnné listu jsou:

source: **Title**: Title from the folio.
cs: **Název**: Název listu.

source: **Author**: Author from the folio.
cs: **Autor**: Autor z listu.

source: **Date**: Date of creation of the folio.
cs: **Datum**: Datum vytvoření listu.

source: **File**:
cs: **Soubor**: Soubor

source: **Folio**: Folio information (Label).
cs: **List**: Informace o listu (štítek).

source: **Plant**: Folio variable named Plant.
cs: **Plant**: Proměnná listu pojmenovaná Plant.

source: **Location**: Folio variable named Location.
cs: **Umístění**: Proměnná listu pojmenovaná Location.

source: **Rev index**: Revision index from the folio.
cs: **Číslo změny**: Číslo změny z listu.

source: **Page Num**: Auto numbering pattern from the folio.
cs: **Číslo strany**: Vzor automatického číslování z listu.

source: For more information about default variables, refer to `variables`_ section.
cs: Další informace o výchozích proměnných najdete v části k `proměnným`_.

source: Costum properties folio tab
cs: Karta listu s vlastními vlastnostmi

source: The **Costum** tab is the section where custom variables can be defined.
cs: Karta **Vlastní** je část, kde lze stanovit vlastní proměnné.

source: Figure: Folio title block custom tab
cs: Obrázek: Vlastní karta záhlaví výkresu v listu

source: To define a user folio variable:
cs: Pro stanovení vlastní proměnné listu:

source: Define variable name at the **Name** column from the variables table.
cs: Stanovte název proměnné ve sloupci **Název** z tabulky proměnných.

source: Define variable value at the **Value** column from the variables table.
cs: Stanovte hodnotu proměnné ve sloupci **Hodnota** z tabulky proměnných.
