Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/properties/display.po
Languages: cs

source: Display project properties
cs: Zobrazení vlastností projektu

source: The `project properties`_ can be displayed in a PopUP window from `menu bar`_ and `projects panel`_.
cs: `Vlastnosti projektu`_ lze zobrazit ve vyskakovacím okně přes `hlavní nabídku`_ a `panel projektů`_.

source: Project properties from menu bar
cs: Vlastností projektu přes hlavní nabídku

source: Select **Project > Project properties** menu item to display the `project properties`_ PopUP window from the active project.
cs: Pro zobrazení vyskakovacího okna s `vlastnostmi projektu`_ činného projektu vyberte položku nabídky **Projekt > Vlastnosti projektu**.

source: Figure: QElectroTech project menu
cs: Obrázek: Nabídka pro projekt v QElectroTechu

source: If more than one `projects`_ is opened, be sure that the active `projects`_ is the correct before changing properties.
cs: Pokud je otevřen více než jeden `projekt`_, ujistěte se před změnou vlastností, že činný projekt je ten správný.

source: Project properties from project panel
cs: Vlastnosti projektu přes panel s projektem

source: The advantage of displaying the `project properties`_ from `projects panel`_ is the posibility to choose `projects`_ which are opened and are not the active `project`_.
cs: Výhodou zobrazení `vlastností projektu`_ přes `panel s projekty`_ je možnost vybrat `projekty`_, které jsou otevřené a nejsou činnými `projekty`_.

source: Right click on the `project`_ from the tree of the `projects panel`_.
cs: Klepněte pravým tlačítkem myši na `projekt`_ ve stromu `panelu s projekty`_.

source: Select **Project properties** to display the `project properties`_ PopUP window.
cs: Pro zobrazení vyskakovacího okna s `vlastnostmi projektu`_ vyberte **Vlastnosti projektu**.

source: Figure: QElectroTech projects panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: If the `projects panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**.
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**.
