Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/properties/numbering_prop.po
Languages: cs

source: Auto numbering properties
cs: Vlastnosti automatického číslování

source: For managing projects during manufacturing, erection, commissioning and maintenance phase; a codification criteria has to be defined in the engineering phase, otherwise, the work is uneficient and the project a caos.
cs: Pro řízení projektů během výroby, montáže, uvedení do provozu a fáze údržby musí být v inženýrské fázi stanovena třídicí hlediska, jinak je práce neúčinná a v projektu je zmatek.

source: QElectroTech allows defining auto numbering patterns in the project properties for the codification of `elements`_, `conductors`_ and `folios`_.
cs: QElectroTech umožňuje stanovit vzory automatického číslování ve vlastnostech projektu pro třídění `prvků`_, `vodičů`_ a `listů`_.

source: Every time that a new folio is added to the `project`_ or an `element`_ or `conductor`_ is drawn in the `workspace`_; the `folio`_, `element`_ or `conductor`_ is codificated according to the selected patter in `auto numbering selection panel`_.
cs: Pokaždé, když je do `projektu`_ přidán nový list nebo je v `pracovní ploše`_ nakreslen `prvek`_ nebo `vodič`_; list, prvek nebo vodič je tříděn podle v panelu pro výběr automatického číslování vybraného vzoru.

source: Figure: Project management properties window
cs: Obrázek: Okno s vlastnostmi správy projektu

source: Display auto numbering properties from menu bar
cs: Zobrazení vlastností automatického číslování přes hlavní nabídku

source: Select **Project > Project properties** menu item to display the project properties PopUp window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi projektu vyberte položku nabídky **Projekt > Vlastnosti projektu**.

source: Go to **Auto Numbering** project properties section.
cs: Jděte do části s vlastnostmi projektu **Automatické číslování**.

source: Go to **Conductor**, **Element** or **Folio** tab to display the desired auto numbering patterns.
cs: Pro zobrazení požadovaných vzorů automatického číslování jděte do karty **Vodič**, **Prvek** nebo **List**.

source: Display auto numbering properties from panel
cs: Zobrazení vlastností automatického číslování v panelu

source: The project auto numbering properties can be displayed from `auto numbering selection panel`_.
cs: Vlastnosti automatického číslování projektu lze zobrazit v `panelu pro výběr automatického číslování`_.

source: Press |configure| **Configure** button from `auto numbering selection panel`_ to display **Auto Numbering** project properties section at a PopUp window.
cs: Stiskněte tlačítko **Nastavit** |configure| v `panelu pro výběr automatického číslování`_ pro zobrazení části s vlastnostmi projektu **Automatické číslování** ve vyskakovacím okně.

source: If the `auto numbering selection panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**.
cs: Pokud se `panel pro výběr automatického číslování`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**.

source: For more information about auto numbering pattern definition refer to:
cs: Další informace o stanovení vzoru pro automatické číslování najdete v:

source: Folio numbering section
cs: Část číslování listů

source: `Conductor numbering section`_
cs: `Část číslování vodičů`_

source: `Element numbering section`_
cs: `Část číslování prvků`_
