Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/replace/advanced_replace.po
Languages: cs

source: Advanced replace
cs: Pokročilé nahrazování

source: QElectroTech provides the possibility to define a string and replace if for a new defining some conditions:
cs: QElectroTech poskytuje možnost stanovit řetězec a nahrazovat za nový při splnění určitých stanovených podmínek:

source: Type of object.
cs: Typ předmětu.

source: Object property with the defined value.
cs: Vlastnost předmětu se stanovenou hodnotou.

source: Filtering `folio`_, `type of element`_, etc.
cs: Filtrování `listu`_, `typu prvku`_ atd.

source: If the `search menu`_ is not displayed, it can be displayed from **Edit > Search / Replace** menu item.
cs: Pokud se `nabídka vyhledávání`_ nezobrazí, lze ji zobrazit přes položku nabídky **Úpravy > Hledat/Nahradit**.

source: To replace text information from project objects:
cs: Pro nahrazení textových informací v předmětech projektu:

source: Press **advanced** button to display advanced replace PopUp window.
cs: Stiskněte tlačítko ``Pokročilé`` pro zobrazení vyskakovacího okna pro pokročilé nahrazování.

source: Define QElectroTech object type from **Who** combobox (Ex.: `Element`_).
cs: Stanovte typ předmětu QElectroTechu v rozbalovacím seznamu **Kdo** (například: `Prvek`_).

source: Figure: QElectroTech advanced replace PopUp window
cs: Obrázek: Vyskakovací okno pro pokročilé nahrazování v QElectroTechu

source: Define object property type from **What** combobox (Ex.: Manufacturer).
cs: Stanovte vlastnost předmětu v rozbalovacím seznamu **Co** (například: Výrobce).

source: Define the property value which should be replaced in the **Replace** text box (Ex.: SIEMENS).
cs: Stanovte hodnotu vlastnosti, která se má nahradit v textovém poli **Nahradit** (například: SIEMENS).

source: Define the new property value at the replace text box in the **By** text box (Ex.: SCHNEIDER).
cs: Stanovte novou hodnotu vlastnosti v poli pro nahrazení textu v textovém poli **Čím** (například: SIEMENS).

source: Press **OK** button to storage the desired replacing conditions.
cs: Stiskněte tlačítko **OK** pro uložení požadovaných podmínek nahrazení.

source: Filter in the object tree the `folios`_ where the action should be applied.
cs: Filtrujte ve stromu předmětů `listy`_, kde se má úkon použít.

source: Figure: QElectroTech search menu element properties PopUP window
cs: Obrázek: Vyskakovací okno s vlastnostmi prvku ve vyhledávací nabídce v QElectroTechu

source: Press **Replace all** button to apply the replace action.
cs: Stiskněte tlačítko **Nahradit vše** pro provedení úkonu nahrazení.
