Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/replace/conductor_prop_replace.po
Languages: cs

source: Replace conductor property
cs: Nahrazení vlastnosti vodiče

source: QElectroTech provides the feature of automatic searching of `conductor`_ with an specific property for replacing `conductor properties`_ without the need of searching the `conductor`_ manually arround the project.
cs: QElectroTech poskytuje funkci automatického vyhledání `vodiče`_ s určitou vlastností pro nahrazení `vlastností vodiče`_ bez potřeby hledat vodič v projektu ručně.

source: If the `search menu`_ is not displayed, it can be displayed from **Edit > Search / Replace** menu item.
cs: Pokud se `nabídka vyhledávání`_ nezobrazí, lze ji zobrazit přes položku nabídky **Úpravy > Hledat/Nahradit**.

source: To replace some `conductor properties`_:
cs: Pro nahrazení některých `vlastností vodiče`_:

source: `Search`_ the property (Manufacturer, Lable, etc.) which identifies the `conductor`_ from which a property has to be changed.
cs: `Hledejte`_ vlastnost (výrobce, popis atd.), která určuje `vodič`_, jehož vlastnost je třeba změnit.

source: Figure: QElectroTech search menu
cs: Obrázek: Nabídka pro vyhledávání v QElectroTechu

source: Press the **Conductor** button to display the conductor properties PopUp window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi vodiče stiskněte tlačítko ``Vodič``.

source: Figure: QElectroTech conductor properties replace PopUp windows
cs: Obrázek: Vyskakovací okna pro nahrazení vlastností vodiče v QElectroTechu

source: Fill the text line box from the `conductor property/ies`_ which should be changed.
cs: Vyplňte řádkové textové pole s `vlastností/vlastnostmi vodiče`_, které se mají změnit.

source: QElectroTech also allows deleting and making empty a filled property. Click at the cliked button from the `conductor property/ies`_ which should be deleted.
cs: QElectroTech umožňuje také mazání a vyprazdňování vyplněné vlastnosti. Klepněte na tlačítko s `vlastností/vlastnostmi vodiče`_, která(é) se má/mají smazat.

source: Press **Accept**.
cs: Stiskněte **OK**.

source: From the `conductors`_ found at the search process, select the `conductors`_ where the replace action have to be applied. The selection can be made at the object tree from the `search menu`_.
cs: Z vodičů nalezených při hledání vyberte `vodiče`_, na něž je třeba použít úkon nahrazení. Výběr lze vytvořit ve stromové struktuře předmětů v `nabídce pro vyhledávání`_.

source: Press **Replace all** button to apply the replace action to all selected `conductors`_.
cs: Stiskněte tlačítko **Nahradit vše** pro provedení úkonu nahrazení u všech vybraných `vodičů`_.

source: Replacing action can also be applied `conductor`_ by `conductor`_. The button **Replace** will only apply the action to the displayed `conductor`_ at the `workspace`_. The buttons |go-top| and |go-bottom| can be used to display the previous and next `conductor`_ from the search result.
cs: Nahrazovací úkon lze také provést `vodič`_ za vodičem. Tlačítko **Nahradit** úkon provede pouze na v `pracovní ploše`_ zobrazeném vodiči. Tlačítka |go-top| a |go-bottom| lze použít k zobrazení předchozího a dalšího vodiče výsledku vyhledávání.
