Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/replace/element_prop_replace.po
Languages: cs

source: Replace element property
cs: Nahrazení vlastnosti prvku

source: QElectroTech provides the feature of automatic searching of `element`_ with an specific property for replacing `element properties`_ without the need of searching the `element`_ manually arround the project.
cs: QElectroTech poskytuje funkci automatického vyhledání `prvku`_ s určitou vlastností pro nahrazení `vlastností prvku`_ bez potřeby hledat prvek v projektu ručně.

source: If the `search menu`_ is not displayed, it can be displayed from **Edit > Search / Replace** menu item.
cs: Pokud se `nabídka vyhledávání`_ nezobrazí, lze ji zobrazit přes položku nabídky **Úpravy > Hledat/Nahradit**.

source: To replace some `element properties`_:
cs: Pro nahrazení některých `vlastností prvku`_:

source: `Search`_ the property (Manufacturer, Lable, etc.) which identifies the `element`_ from which a property has to be changed.
cs: `Hledejte`_ vlastnost (výrobce, popis atd.), která určuje `prvek`_, jehož vlastnost je třeba změnit.

source: Figure: QElectroTech search menu
cs: Obrázek: Nabídka pro vyhledávání v QElectroTechu

source: Press the **Element** button to display the element properties PopUp window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi prvku stiskněte tlačítko **Prvek**.

source: Figure: QElectroTech element properties replace PopUp windows
cs: Obrázek: Vyskakovací okna pro nahrazení vlastností prvku v QElectroTechu

source: Fill the text line box from the `element property/ies`_ which should be changed.
cs: Vyplňte řádkové textové pole s `vlastností/vlastnostmi prvku`_, které se mají změnit.

source: QElectroTech also allows deleting and making empty a filled property. Click at the cliked button from the `element property/ies`_ which should be deleted.
cs: QElectroTech umožňuje také mazání a vyprazdňování vyplněné vlastnosti. Klepněte na tlačítko s `vlastností/vlastnostmi prvku`_, která(é) se má/mají smazat.

source: Press **Accept**.
cs: Stiskněte **OK**.

source: From the `elements`_ found at the search process, select the `elements`_ where the replace action have to be applied. The selection can be made at the object tree from the `search menu`_.
cs: Z prvků nalezených při hledání vyberte `prvky`_, na něž je třeba použít úkon nahrazení. Výběr lze vytvořit ve stromové struktuře předmětů v `nabídce pro vyhledávání`_.

source: Press **Replace all** button to apply the replace action to all selected `elements`_.
cs: Stiskněte tlačítko **Nahradit vše** pro provedení úkonu nahrazení u všech vybraných `prvků`_.

source: Replacing action can also be applied `element`_ by `element`_. The button **Replace** will only apply the action to the displayed `element`_ at the `workspace`_. The buttons |go-top| and |go-bottom| can be used to display the previous and next `element`_ from the search result.
cs: Nahrazovací úkon lze také provést `prvek`_ za prvkem. Tlačítko **Nahradit** úkon provede pouze na v `pracovní ploše`_ zobrazeném prvku. Tlačítka |go-top| a |go-bottom| lze použít k zobrazení předchozího a dalšího prvku výsledku vyhledávání.
