Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/replace/folio_prop_replace.po
Languages: cs

source: Replace folio property
cs: Nahrazení vlastnosti listu

source: QElectroTech provides the feature of automatic searching of `folios`_ with an specific property for replacing `folio properties`_ without the need of opening the folio properties PopUp window.
cs: QElectroTech poskytuje funkci automatického vyhledání `listů`_ s určitou vlastností pro nahrazení `vlastností listu`_ bez potřeby otevřít vyskakovací okno s vlastnostmi listu ručně.

source: If the `search menu`_ is not displayed, it can be displayed from **Edit > Search / Replace** menu item.
cs: Pokud se `nabídka vyhledávání`_ nezobrazí, lze ji zobrazit přes položku nabídky ** Úpravy > Hledat/Nahradit**.

source: To replace some `folio properties`_:
cs: Pro nahrazení některých `vlastností listu`_:

source: `Search`_ the content which should identify the `folio`_ from which a property has to be changed.
cs: `Hledejte`_ obsah, který určuje `list`_, jehož vlastnost je třeba změnit.

source: Figure: QElectroTech search menu
cs: Obrázek: Nabídka pro vyhledávání v QElectroTechu

source: Press the **Folio** button to display the folio properties PopUp window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi listu stiskněte tlačítko **List**.

source: Figure: QElectroTech folio properties replace PopUp windows
cs: Obrázek: Vyskakovací okna pro nahrazení vlastností listu v QElectroTechu

source: Fill the text line box from the `folio property/ies`_ which should be changed.
cs: Vyplňte řádkové textové pole s `vlastností/vlastnostmi listu`_, které se mají změnit.

source: QElectroTech also allows deleting and making empty a filled property. Click at the right check button from the `folio property/ies`_ which should be deleted.
cs: QElectroTech umožňuje také mazání a vyprazdňování vyplněné vlastnosti. Klepněte na pravé zaškrtávací tlačítko s `vlastností/vlastnostmi listu`_, která(é) se má/mají smazat.

source: Press **Accept**.
cs: Stiskněte **OK**.

source: From the `folios`_ found at the search process, select the `folios`_ where the replace action have to be applied. The selection can be made at the object tree from the `search menu`_.
cs: Z listů nalezených při hledání vyberte `listy`_, na něž je třeba použít úkon nahrazení. Výběr lze vytvořit ve stromové struktuře předmětů v `nabídce pro vyhledávání`_.

source: Press **Replace all** button to apply the replace action to all selected `folios`_.
cs: Stiskněte tlačítko **Nahradit vše** pro provedení úkonu nahrazení u všech vybraných `listů`_.

source: Replacing action can also be applied `folio`_ by `folio`_. The button **Replace** will only apply the action to the displayed `folio`_ at the `workspace`_. The buttons |go-top| and |go-bottom| can be used to display the previous and next `folio`_ from the search result.
cs: Nahrazovací úkon lze také provést `list`_ za listem. Tlačítko **Nahradit** úkon provede pouze na v `pracovní ploše`_ zobrazeném listu. Tlačítka |go-top| a |go-bottom| lze použít k zobrazení předchozího a dalšího listu výsledku vyhledávání.
