Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/collection/create_folder.po
Languages: cs

source: Create category
cs: Vytvoření skupiny

source: Working with collections can only be done from `collections panel`_.
cs: Práce se sbírkami lze provádět pouze v `panelu se sbírkami`_.

source: Select **Settings > Display > Collections** menu item to display the `collections panel`_.
cs: Pro zobrazení `panelu se sbírkami`_ vyberte položku nabídky **Nastavení > Zobrazení > Sbírky**.

source: QElectroTech allows creating categories at some collection. The user has only read rights at `QET collection`_, the user can create categories at `User collection`_.
cs: QElectroTech umožňuje vytvoření skupin v některé ze sbírek. Uživatel si má pouze přečíst práva pro sbírku `QET`_. Uživatel může sbírky vytvořit ve `vlastní`_ sbírce.

source: Right click on `User collection`_ or at a category / sub-category from the `User collection`_.
cs: Klepněte pravým tlačítkem na `vlastní`_ sbírku nebo ve skupině/podskupině vlastní sbírky.

source: Figure: Options at folder
cs: Obrázek: Volby pro složku

source: Click the option **New folder** to open **Add a new category** PopUP window.
cs: Pro otevření vyskakovacího okna pro otevření **Přidat novou skupinu** klepněte na **Nová složka**.

source: Figure: New category PopUP window
cs: Obrázek: Vyskakovací okno pro novou skupinu

source: Define the internal name for the file system.
cs: Stanovte vnitřní název souborového systému.

source: Define the category name that will be displayed at the collection tree, it can be defined in many languages.
cs: Stanovte název skupiny, který se zobrazí ve stromu sbírky. Lze jej stanovit v mnoha jazycích.

source: Press **OK** to add the new category / sub-category.
cs: Stiskněte ** OK ** pro přidání nové skupiny/podskupiny.

source: QElectroTech works according `ISO 639-1`_ norm. The folder name language is defined using 2 letter code which should be used at the language column from the folder internal name table.
cs: QElectroTech pracuje podle normy `ISO 639-1`_. Jazyk názvu složky je stanoven pomocí dvojpísmenného kódu, který se má použít ve sloupci jazyka tabulky s vnitřním názvem složky.
