Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/collection/edit_folder.po
Languages: cs

source: Edit category
cs: Upravení skupiny

source: Working with collections can only be done from `collections panel`_.
cs: Práce se sbírkami lze provádět pouze v `panelu se sbírkami`_.

source: Select **Settings > Display > Collections** menu item to display the `collections panel`_.
cs: Pro zobrazení `panelu se sbírkami`_ vyberte položku nabídky **Nastavení > Zobrazení > Sbírky**.

source: Right click on the user collection or at a category from the collection which should be edited.
cs: Klepněte pravým tlačítkem na vlastní sbírku nebo na skupinu sbírky, která se má upravit.

source: Figure: Options at folder
cs: Obrázek: Volby pro složku

source: Click the option **Edit folder** to open **Add a new category** PopUP window.
cs: Pro otevření vyskakovacího okna pro otevření **Přidat novou skupinu** klepněte na **Upravit složku**.

source: Figure: New category PopUP window
cs: Obrázek: Vyskakovací okno pro novou skupinu

source: Edit the category name or add a new translation from the category name pressing **Add a line**.
cs: Upravte název skupiny nebo přidejte nový překlad názvu skupiny stisknutím **Přidat řádek**.

source: Press **OK** to change the category properties.
cs: Stiskněte **OK** pro změnu vlastností skupiny.

source: QElectroTech works according `ISO 639-1`_ norm. The folder name languaje is defined using 2 letter code which should be used at the languaje column from the folder internal name table.
cs: QElectroTech pracuje podle normy `ISO 639-1`_. Jazyk názvu složky je stanoven pomocí dvojpísmenného kódu, který se má použít ve sloupci jazyka tabulky hodnot buňky.
