Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/collection/user_collection.po
Languages: cs

source: User collection
cs: Vlastní sbírka

source: The User collection is the QElectroTech collection where the user can create and organize `elements`_, the user is allowed to read and edit the collection. The actions allowed at the user collection are:
cs: **Vlastní** sbírka je sbírkou QElectroTechu, kde uživatel může vytvořit a pořádat `prvky`_, uživatel má právo číst a upravovat sbírku. Povolenými činnostmi ve vlastní sbírce jsou:

source: Add new elements.
cs: Přidání nových prvků.

source: Edit elements from the collection.
cs: Upravení prvků ve sbírce.

source: Delete elements from the collection.
cs: Smazání prvků ze sbírky.

source: Create new categories / folders.
cs: Vytvoření nových skupin/složek.

source: Create new sub-categories / sub-folders.
cs: Vytvoření nových skupin/podsložek.

source: Delete categories or sub-categories.
cs: Smazání skupin nebo podskupin.

source: Re-organize the collection.
cs: Přeuspořádání sbírky.

source: Figure: Example user collection tree at collection panel
cs: Obrázek: Příklad stromu uživatelské sbírky v panelu se sbírkou
