Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/panels/autonumbering_panel.po
Languages: cs

source: Auto Numbering Selection panel
cs: Panel pro výběr automatického číslování

source: The Auto Numbering Selection panel displays the active `auto numbering pattern`_ for:
cs: Panel pro výběr automatického číslování zobrazuje činný `vzor pro automatického číslování`_ pro:

source: `Folio`_
cs: `List`_

source: `Element`_
cs: `Prvek`_

source: `Conductor`_
cs: `Vodič`_

source: Figure: QElectroTech Auto Numbering Selection panel
cs: Obrázek: Panel pro výběr automatického číslování v QElectroTechu

source: To display or hidden the Auto Numbering Selection panel:
cs: Pro zobrazení nebo skrytí panelu pro výběr automatického číslování:

source: Select **Settings > Display > Auto Numbering Selection** menu item.
cs: Vyberte položku nabídky **Nastavení > Zobrazení > Výběr automatického číslování**.

source: The main function from the Auto Numbering Selection panel is to manage `auto numbering patterns`_.
cs: Hlavní funkcí panelu automatický výběr číslování je správa `vzorů pro automatické číslování`_.

source: Select the active folio auto numbering pattern
cs: Vyberte vzor automatického číslování pro činný list

source: Select the active element auto numbering pattern
cs: Vyberte vzor automatického číslování pro činný prvek

source: Figure: QElectroTech element pattern selection
cs: Obrázek: Výběr vzoru pro prvek v QElectroTechu

source: Select the active conductor auto numbering pattern
cs: Vyberte vzor automatického číslování pro činný vodič

source: Figure: QElectroTech conductor pattern selection
cs: Obrázek: Výběr vzoru pro vodič v QElectroTechu

source: For more information about how to use the Auto Numbering Select panel during folio addition, refer to `add folio`_ section.
cs: Další informace o tom, jak používat panel pro výběr automatického číslování během přidávání listu najdete v části k `přidání listu`_.

source: For more information about how to use the Auto Numbering Select panel during element addition, refer to `add element`_ section.
cs: Další informace o tom, jak používat panel pro výběr automatického číslování během přidávání prvku najdete v části k `přidání prvku`_.

source: For more information about how to use the Auto Numbering Select panel during conductor creation, refer to `create conductor`_ section.
cs: Další informace o tom, jak používat panel pro výběr automatického číslováníběhem přidávání vodiče najdete v části k `přidání vodiče`_.
