Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/panels/collections_panel.po
Languages: cs

source: Collections panel
cs: Panel se sbírkami

source: The colections panel displays the `QET`_, `user`_ and `projects`_ element collections.
cs: Panel se sbírkami zobrazuje sbírky s prvky `QET`_, `vlastní`_ a `projektu`_ .

source: Figure: QElectroTech collections panel
cs: Obrázek: Panel se sbírkami v QElectroTechu

source: To display or hidden the collections panel:
cs: Pro zobrazení nebo skrytí panelu se sbírkami:

source: Select **Settings > Display > Collections** menu item.
cs: Vyberte položku nabídky **Nastavení > Zobrazení > Sbírky**.

source: The main function from the collections panel is to manage `elements`_. The tasks which can be done from collections panel are:
cs: Hlavní funkcí panelu se sbírkami je správa `prvků`_. Úkoly, které lze provádět z panelu se sbírkami, jsou:

source: Manage `user`_ collection (Create, edit and delete elements from the collection).
cs: Spravovat `vlastní`_ sbírku (vytvářet, upravovat a mazat prvky ve sbírce).

source: Edit elements from project collection.
cs: Upravit prvky ve sbírce projektu.

source: Search elements from the project collection at the `workspace`_.
cs: Hledat prvky ve sbírce projektu v `pracovní ploše`_.

source: Import elements from `QET`_ or `user`_ collection to the project (Add new element to workspace).
cs: Zavést prvky ze sbírky `QET`_ nebo `vlastní`_ do projektu (přidat do pracovní plochy nový prvek).

source: To make easier the work with the collections panel, QElectroTech provides a search tool that makes faster finding elements inside the different collections.
cs: Pro usnadnění práce s panelem se sbírkami QElectroTech poskytuje vyhledávací nástroj, který umožňuje rychlejší hledání prvků uvnitř různých sbírek.
