Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/panels/selection_properties_panel.po
Languages: cs

source: Selection properties panel
cs: Panel s vlastnostmi výběru

source: The selection properties panel displays the properties from the selecte object. Only the properties from some object can be displayed at the panel. The selection properties panel can display the properties from:
cs: Panel s vlastnostmi výběru zobrazuje vlastnosti vybraného předmětu. V panelu lze zobrazit pouze vlastnosti nějakého předmětu. Panel s vlastnostmi výběru může zobrazit vlastnosti:

source: `Elements`_
cs: `Prvky`_

source: Some `basic objects`_: `line`_, `rectangle`_, `ellipse`_, `polygon`_ and `picture`_.
cs: Některé `základní předměty`_: `čára`_, `obdélník`_, `elipsa`_, `mnohoúhelník`_ a `obrázek`_.

source: Figure: QElectroTech selection properties panel
cs: Obrázek: Panel s vlastnostmi výběru v QElectroTechu

source: To display or hidden the selection properties panel:
cs: Pro zobrazení nebo skrytí panelu s vlastnostmi výběru:

source: Select **Settings > Display > Selection properties** menu item.
cs: Vyberte položku nabídky **Nastavení > Zobrazení > Vlastnosti výběru**.

source: The main function of the selection properties panel is to manage the object properties. At QElectroTech, the object properties can be different for each object. The main tasks that can be done from the selection properties panel are:
cs: Hlavní funkcí panelu s vlastnostmi výběru je správa vlastností předmětu. V QElectroTechu mohou být vlastnosti předmětu pro každý předmět jiné. Hlavní úkoly, které lze provést z panelu s vlastnostmi výběru jsou:

source: Manage the properties from the basic geometrical objects (`line`_, `rectangle`_, `ellipse`_ and `polygon`_).
cs: Spravovat vlastnosti základních geometrických předmětů (`čára`_, `obdélník`_, `elipsa`_ a `mnohoúhelník`_).

source: Define the scale from the imported `pictures`_.
cs: Stanovit měřítko zavedených `obrázků`_.

source: Lock the position of the `basic objects`_ (`line`_, `rectangle`_, `ellipse`_, `polygon`_ and `picture`_).
cs: Zamknout polohu `základních předmětů`_ (`čára`_, `obdélník`_, `elipsa`_, `mnohoúhelník`_ a `obrázek`_).

source: Manage the information from the `elements`_ (label, function, manufacturer, article number, order number, etc.).
cs: Spravovat informace `prvků`_ (štítek, funkce, výrobce, číslo výrobku, číslo objednávky atd.).

source: Manage the text and dynamic text from element symbols.
cs: Spravovat text a dynamický text symbolů prvků.

source: Display the general element properties (name, position, dimensions, number of terminals, etc.).
cs: Zobrazit obecné vlastnosti prvku (název, poloha, rozměry, počet svorek atd.).

source: Manage the element links (cross references).
cs: Spravovat odkazy na prvky (křížové odkazy).
