Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/panels/undo_panel.po
Languages: cs

source: Undo panel
cs: Panel pro zpět

source: The Undo panel displays the history since the last time that the document was saved. Once the `project`_ is saved, undo panel is automatically cleared.
cs: Panel pro vracení provedených kroků zpět zobrazuje historii od posledního uložení dokumentu. Jakmile je `projekt`_ uložen, panel zpět je automaticky vymazán.

source: Figure: QElectroTech Undo panel
cs: Obrázek: Panel pro zpět v QElectroTechu

source: To display or hidden the undo panel:
cs: Pro zobrazení nebo skrytí panelu pro zpět:

source: Select **Settings > Display > Undo** menu item.
cs: Vyberte položku nabídky **Nastavení > Zobrazení > Zpět**.

source: The undo panel is used to return the `project`_ to the status after one of the actions made after last save. By one click on one of the actions listed at undo panel, the `project`_ will return to the status after the action choosed at the panel. While the `project`_ is not saved again, the user can go to the different status as many times he wants.
cs: Panel pro zpět se používá k vrácení `projektu`_ do stavu po jedné z činností provedených po posledním uložení. Jedním klepnutím na jednu z činností uvedených v panelu Zpět, se projekt vrátí do stavu po činnosti zvolené v panelu. I když se projekt znovu neuloží, uživatel může přejít do jiného stavu, kolikrát chce.

source: If you play with the panel, be sure that you are at the correct history status before continue working, saving `project`_ or any irreversible action like `delete folio`_. Once the `project`_ is saved or an irreversible action is made, the history is cleared.
cs: Pokud si hrajete s panelem, ujistěte se, že jste ve správném stavu historie před pokračováním v práci, uložením `projektu`_ nebo jakoukoli nevratnou činností jako `smazat list`_. Jakmile je projekt uložen nebo dojde k provedení nevratné činnosti, historie je vymazána.

source: Using the undo panel is interested for:
cs: Používání panelu pro zpět je zajímavé pro:

source: Coming back some steps with a click.
cs: Vrácení několika kroků jedním klepnutím.

source: Recovering an object which was deleted some steps before. The object can be recovered coming back one step before the elimination, `copying the object`_, coming back to the last history status and `pasting the object`_.
cs: Obnovení předmětu, který byl před několika kroky odstraněn. Předmět může být obnoven vrácením se o jeden krok před odstraněním, `kopírováním předmětu`_, návratem do posledního stavu historie a `vložením předmětu`_.

source: Checking the status from the `project`_ some steps before.
cs: Ověření stavu `projektu`_ o několik kroků dříve.

source: Etc.
cs: A tak dále a tak podobně.
