Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/elements/row.po
Languages: cs

source: Row
cs: Řádek

source: Definition
cs: Popis

source: A row of `cells`_ from the `title block`_ is a group of `cells`_ that are placed one beside the other.
cs: Řádek `buněk`_ v `záhlaví výkresu`_ je skupina buněk, které jsou umístěny jedna nad druhou.

source: Figure: QElectroTech title block row
cs: Obrázek: Řádek v záhlaví výkresu v QElectroTechu

source: Properties
cs: Vlastnosti

source: A row from the `title block`_ has only one property, the height of the `cells`_ that are part of the row.
cs: Řádek v `záhlaví výkresu`_ má pouze jednu vlastnost, výšku `buněk`_, které jsou součástí řádku.

source: To display the row height:
cs: Pro zobrazení výšky řádku:

source: Double click on the row head.
cs: Dvakrát klepněte na záhlaví řádku.

source: Figure: QElectroTech title block row height property
cs: Obrázek: Vlastnost výšky řádku v záhlaví výkresu v QElectroTechu

source: QElectroTech works with pixels, the height of the row can only be defined according pixel unit.
cs: QElectroTech pracuje s obrazovými body (pixely), výška řádku je stanovena podle pixelové jednotky.
