Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/conductor/conductor_creation.po
Languages: cs

source: Create conductor
cs: Vytvoření vodiče

source: Manual conductor creation
cs: Ruční vytvoření vodiče

source: To create a `conductor`_ manually:
cs: Pro ruční vytvoření `vodiče`_:

source: Select `auto numbering pattern`_ at the `Auto numbering selection panel`_.
cs: V `panelu pro výběr automatického číslování`_ vyberte `vzor automatického číslování`_.

source: Figure: QElectroTech Auto numbering selection panel
cs: Obrázek: Panel pro výběr automatického číslování v QElectroTechu

source: If the `Auto numbering selection panel`_ is not displayed, it can be displayed from **Settings > Display > Auto numbering selection**.
cs: Pokud se `panel pro výběr automatického číslování`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Výběr automatického číslování**.

source: Click on the initial `terminal`_ from the `conductor`_.
cs: Klepněte na počáteční `svorku`_ `vodiče`_.

source: Without releasing, move the mouse up to the end `terminal`_ of the `conductor`_.
cs: Bez uvolnění myš přesuňte nahoru na koncovou `svorku`_ `vodiče`_.

source: Once the end `terminal`_ is automatically identified by QElectroTech, release the mouse to create the `conductor`_.
cs: Jakmile QElectroTech automaticky rozpozná konec `svorky`_, uvolněte myš pro vytvoření `vodiče`_.

source: Figure: QElectroTech manual conductor creation
cs: Obrázek: Ruční vytvoření vodiče v QElectroTechu

source: Automatic conductor creation
cs: Automatické vytvoření vodiče

source: To increase the working eficiency, QElectroTech can create `conductors`_ automatically when an `element`_ is added to the `workspace`_.
cs: Pro zvýšení účinnosti práce může QElectroTech vytvářet `vodiče`_automaticky, když je `prvek`_ přidán do `pracovní plochy`_.

source: To create a `conductor`_ automatically:
cs: Pro automatické vytvoření `vodiče`_:

source: Select the icon |autoconnect| from `toolbar`_, if it is not selected.
cs: Vyberte ikonu |autoconnect| v `panelu nástrojů`_, pokud není vybrána.

source: `Add element`_ to `workspace`_ taking care of the `element`_ position, the initial `terminal`_ and the end `terminal`_ have to be at the same vertical or horizontal line.
cs: `Přidejte prvek`_ do `pracovní plochy`_. O polohu prvku se postará program.Počáteční `svorka`_ a koncová `svorka`_ musí být ve stejnémsvislém nebo vodorovném řádku.

source: Figure: QElectroTech automatic conductor creation
cs: Obrázek: Automatické vytvoření vodiče v QElectroTechu

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes**Nastavení > Zobrazení > Nástroje**.

source: At the case that the initial and end `terminal`_ are different potentials, QElectroTech considers two `terminals`_ from the same `element`_ as different potentials, QElectroTech will inform by a warning PopUP window. Nevertheless, QElectroTech will create the `conductor`_
cs: V případě, že se počáteční a koncová `svorka`_ lišípotenciály, QElectroTech považuje dvě `svorky`_ stejného`prvku`_ za různé potenciály. QElectroTech bude informovat upozorněnímve vyskakovacím okně. QElectroTech vytvoří `vodič`_

source: Figure: QElectroTech different potentials warning
cs: Obrázek: Upozornění na různé potenciály v QElectroTechu
