Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/conductor/conductor_reset.po
Languages: cs

source: Reset conductors
cs: Obnovení výchozích vodičů

source: QElectroTech provides the posibility to return to the default route once a conductor route has been modify.
cs: QElectroTech poskytuje možnost vrátit se k výchozí cestě, poté co už byla cesta vodiče upravena.

source: Figure: QElectroTech reset conductor
cs: Obrázek: Obnovení výchozího vodiče v QElectroTechu

source: QElectroTech allows resetting the route of a `conductor`_ from `menu bar`_, `toolbar`_, `workspace`_ or using keyboard shortcut.
cs: QElectroTech umožňuje obnovit výchozí cestu `vodiče`_ přes `hlavní nabídku`_, `panel nástrojů`_, `pracovní plochu`_ nebo pomocí klávesové zkratky.

source: Reset conductor from menu bar
cs: Obnovení výchozího vodiče přes hlavní nabídku

source: `Select the conductor`_ which route should be reseted.
cs: `Vyberte vodič`_, jehož výchozí cesta se má obnovit.

source: Select **Edit > Reset conductors** menu item to reset the conductor route.
cs: Pro obnovení výchozí cesty vodiče vyberte položku nabídky **Úpravy > Obnovit výchozí vodiče**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Reset conductor from toolbar
cs: Obnovení výchozího vodiče přes pruh s nástroji

source: Select the icon |conductor2| from `toolbar`_ to reset the conductor route.
cs: Pro obnovení výchozí cesty vodiče vyberte v `panelu nástrojů`_ ikonu |conductor2|.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**.

source: Reset conductor from workspace
cs: Obnovení výchozího vodiče v pracovní ploše

source: Right click on the conductor which route should be reseted.
cs: Klepněte pravým tlačítkem myši na vodič, jehož výchozí cesta se má obnovit.

source: Select the option **Reset conductors** to reset the conductor route.
cs: Pro obnovení výchozí cesty vodiče vyberte volbu **Obnovit výchozí vodiče**.

source: Figure: QElectroTech conductor options
cs: Obrázek: Volby pro vodič v QElectroTechu

source: Reset conductor using keyboard shortcut
cs: Obnovení výchozího vodiče pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + k`` to reset the conductor route.
cs: Pro obnovení výchozí cesty vodiče stiskněte ``Ctrl + k``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
