Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/customize/organize_panels.po
Languages: cs

source: Organize panels
cs: Uspořádání panelů

source: QElectroTech GUI has been designed to work using the `menu bar`_ and `panels`_. The `menu bar`_ is fixed at top. The `panels`_ can be displayed and hidden.
cs: Uživatelské rozhraní QElectroTechu bylo navrženo tak, aby fungovalo s pomocí `hlavní nabídky`_ a `panelů`_. Hlavní nabídka je umístěna nahoře. Panely mohou být zobrazeny a skryty.

source: To display or hide `panels`_:
cs: Pro zobrazení nebo skrytí `panelů`_:

source: Select **Settings > Display** menu item to display the `panels`_ and `toolbars`_ list.
cs: Pro zobrazení `panelů`_ a seznamu `nástrojových pruhů`_ vyberte položku nabídky **Nastavení > Zobrazení**.

source: Click on the different `panels`_ (Projects, Collections, Undo, Selection properties and Auto numbering Selection) which should be displayed or hidden.
cs: Klepněte na různé `panely`_ (Projekty, Sbírky, Zpět, Vlastnosti výběru a Výběr automatického číslování), které se mají zobrazit nebo skrýt.

source: Figure: QElectroTech Settings > Display menu
cs: Obrázek: Nabídka nastavení pro zobrazení panelů v QElectroTechu

source: All `panels`_ can be displayed at right and left side from `workspace`_. The `panels`_ can be organized on column or by tabs. The `panels`_ can also be displayed as PopUp/floating windows.
cs: Všechny `panely`_ lze zobrazit na pravé a levé straně `pracovního prostoru`_. Panely lze uspořádat ve sloupci nebo v kartách. Panely také mohou být zobrazeny jako vyskakovací okna/plovoucí okna.

source: Figure: QElectroTech user interface
cs: Obrázek: Uživatelské rozhraní QElectroTechu

source: To change the organization of `panels`_:
cs: Pro změnu uspořádání `panelů`_:

source: Left click at the title bar from the `panel`_.
cs: Klepněte levým tlačítkem myši na proužek s názvem `panelu`_.

source: Without releasing the `panel`_, move the mouse to the final position.
cs: Bez uvolnění `panelu`_ přesuňte myš do konečné polohy.

source: Release the `panel`_.
cs: Uvolněte `panel`_.

source: Figure: QElectroTech panels placement
cs: Obrázek: Umístění panelu v QElectroTechu
