Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/interface/customize/organize_toolbars.po
Languages: cs

source: Organize toolbars
cs: Uspořádání nástrojových pruhů

source: The QElectroTech GUI allows having many different `toolbars`_ switched on to make more friendly the application.
cs: Uživatelské rozhraní QElectroTechu umožňuje mít zapnuto, aby byla aplikace přátelštější, mnoho různých `pruhů s nástroji`_.

source: To display or hide `toolbars`_:
cs: Pro zobrazení nebo skrytí `pruhů s nástroji`_:

source: Select **Settings > Display** menu item to display the `panels`_ and `toolbars`_ list.
cs: Pro zobrazení seznamu `panelů`_ a `pruhů s nástroji`_ vyberte položku nabídky **Nastavení > Zobrazení**.

source: Click on the different `toolbars`_ (Tools, Display, Diagram, Add and Depth) which should be displayed or hidden.
cs: Klepněte na různé `pruhy s nástroji`_ (Nástroje, Zobrazení, Výkres, Přidání a Hloubka), které by měly být zobrazeny nebo skryty.

source: Figure: QElectroTech Settings > Display menu
cs: Obrázek: Nabídka nastavení pro zobrazení panelů v QElectroTechu

source: All `toolbars`_ are placed by default under `menu bar`_, in one row. The user is free reorganizing the `toolbars`_. The `toolbars`_ can be organiced in rows, columns at the left or right side from the `workspace`_ or as floating toolbar.
cs: Všechny `pruhy s nástroji`_ jsou ve výchozím nastavení umístěny v jednom řádku pod `hlavní nabídkou`_. Uživatel může `pruhy s nástroji`_ volně přeuspořádávat. `Pruhy s nástroji`_ mohou být uspořádány do řádků, sloupců na levé nebo pravé straně `pracovní plochy`_ nebo jako plovoucí panel nástrojů.

source: Figure: QElectroTech user interface
cs: Obrázek: Uživatelské rozhraní QElectroTechu

source: To change the organization of `toolbars`_:
cs: Pro změnu uspořádání `pruhů s nástroji`_:

source: Left click at the left side from the `toolbar`_.
cs: Klepněte levým tlačítkem myši na levou stranu `pruhu s nástroji`_.

source: Without releasing the `toolbar`_, move the mouse to the final position.
cs: Bez uvolnění `pruhu s nástroji`_ přesuňte myš do konečné polohy.

source: Release the `toolbar`_.
cs: Uvolněte `pruh s nástroji`_.

source: Figure: QElectroTech toolbars placement
cs: Obrázek: Umístění nástrojového pruhu QElectroTechu
