Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/basics/line.po
Languages: cs

source: Line
cs: Čára

source: Create line
cs: Vytvoření čáry

source: To draw more easily, the folio grid can be displayed from **Display > Display the grid** or from `toolbar`_ icon |grid|.
cs: Pro snazší kreslení lze mřížku listu zobrazit přes **Zobrazení > Zobrazit mřížku** nebo v `panelu nástrojů`_ ikona |grid|.

source: A line can only be added to the `workspace`_ by `toolbar`_.
cs: Čáru lze do `pracovní plochy`_ přidat pouze z `panelu nástrojů`_.

source: Select the icon |line| from `toolbar`_ to add a line.
cs: Pro přidání čáry vyberte v `panelu nástrojů`_ ikonu |line|.

source: Click on the initial point from the line.
cs: Klepněte na počáteční bod čáry.

source: Click on the end point from the line.
cs: Klepněte na koncový bod čáry.

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Add**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Přidání**.

source: Line properties
cs: Vlastnosti čáry

source: QElectroTech allows customizing the type of line, the thikness from the line and the color of the line.
cs: QElectroTech umožňuje přizpůsobení typu čáry, tloušťky čáry a barvy čáry.

source: The different types of lines are: **normal**, **dashed**, **dotted**, **dots and dasches**, **dash dot dot** and **custom dash line**.
cs: Různé typy čar jsou: **Plná**, **Čárkovaná**, **Tečkovaná**, **Čerchovaná čára**, **Čerchovaná čára se dvěma tečkami** a **Vlastní čárkovaná čára**.

source: Figure: QElectroTech Color selection PopUP window
cs: Obrázek: Vyskakovací okno pro výběr barvy v QElectroTechu

source: The possible line thiknes are between 0.2 and 50 mm (0.2, 0.4, 0.8, 0.6, 0.8, 1, 1.2, 1.4, ... , 50).
cs: Možné tloušťky čáry jsou mezi 0,2 a 50 mm (0,2, 0,4, 0,8, 0,6, 0,8, 1, 1,2, 1,4, ... , 50).

source: The possible colors are defined by the `RGB scale range`_.
cs: Možné barvy jsou stanoveny `rozsahem stupnice RGB`_.

source: The position from the line can be locked to prevent involuntary movement.
cs: Polohu čáry lze uzamknout, aby se zabránilo nechtěným pohybům.

source: Go to line properties and check the **Lock position** button.
cs: Přejděte na vlastnosti čáry a zaškrtněte tlačítko **Zamknout polohu**.

source: The line properties can be displayed from `menu bar`_, by right click on the line, from selection properties panel and using keyboard shortcut.
cs: Vlastnosti čáry lze zobrazit přes `hlavní nabídku`_, klepnutím pravým tlačítkem na čáru, z panelu vlastností výběru a pomocí klávesové zkratky.

source: Line properties from menu bar
cs: Vlastností čáry přes hlavní nabídku

source: Select the line which should be edited.
cs: Vyberte čáru, která se má upravit.

source: Select **Edit > Edit the selected object** menu item to display the line properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi čáry vyberte položku nabídky **Úpravy > Upravit vybraný předmět**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Line properties by right click
cs: Vlastnosti čáry pomocí klepnutí pravým tlačítkem myši

source: Right click on the line which should be edited.
cs: Klepněte pravým tlačítkem myši na čáru, která se má upravit.

source: Select the option **Edit the selected object** to display the line properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi čáry vyberte **Upravit vybraný předmět**.

source: Figure: QElectroTech line selection PopUP window
cs: Obrázek: Vyskakovací okno pro výběr čáry v QElectroTechu

source: Line properties from selection properties panel
cs: Vlastnosti čáry v panelu s vlastnostmi výběru

source: Select the line which should be edited and the properties from the line will appear at `selection properties panel`_.
cs: Vyberte čáru, která se má upravit, a v `panelu vlastností výběru`_ se objeví vlastnosti čáry.

source: Figure: QElectroTech Line properties panel
cs: Obrázek: Panel s vlastnostmi čáry v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**

source: Line properties using keyboard shortcut
cs: Vlastnosti čáry pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + e`` to display the line properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi čáry stiskněte ``Ctrl + e``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
