Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/properties/new_folio/cross_references.po
Languages: cs

source: Cross references properties
cs: Vlastnosti křížových odkazů

source: The main advantage of using `Master`_ and `Slave`_ elements is the posibility to create `cross references (links)`_ between `elements`_. At the case of `cross references definition`_, QElectroTech provides the posbility to display automatically at the `workspace`_ some information from the `Master`_ or `Slave`_ element linked.
cs: Hlavní výhodou použití `nadřízených`_ a `podřízených`_ prvků je možnost vytvoření `křížových odkazů (odkazů)`_ mezi `prvky`_. V v případě `stanovení křížových odkazů`_ poskytuje QElectroTech možnost automatického zobrazení některých informací propojených `nadřízených`_ a `podřízených`_ prvků v `pracovní ploše`.

source: The definition or cross references properties inside a project can be costumized by the user at `project properties`_.
cs: Vymezení nebo vlastnosti křížových odkazů uvnitř projektu mohou být přizpůsobeny uživatelem ve `vlastnostech projektu`_.

source: QElectroTech allows defining automatically `cross references properties`_ during `project creation`_. For more information about how to standarize some `cross references properties`_ from `project`_ to `project`_, please refers to the `QElectroTech cross references settings`_ section.
cs: QElectroTech umožňuje stanovit `vlastnosti křížových odkazů`_ automaticky během `vytvoření projektu`_. Další informace o tom, jak některé `vlastnosti křížových odkazů`_ od `projektu`_ k `projektu`_ standardizovat, najdete v části `nastavení křížových odkazů v QElectroTechu`_.

source: The **Cross references** tab from **New folio** settings section allows pre-defining some `cross references properties`_:
cs: Karta **Křížové odkazy** v části s nastavením **Nový list** umožňuje stanovení některých `vlastností křížových odkazů`_ předem:

source: Cross references `Master element`_ type (Coil, organ of protection or Switch/button).
cs: Typ křížových odkazů `nadřízený prvek`_ (cívka, ochrana nebo přepínač/tlačítko).

source: Cross references label (Master and slave cross references label to be display at the `workspace`_)
cs: Štítek křížových odkazů (nadřízený a podřízený štítek křížových odkazů k zobrazení v `pracovní ploše`_)

source: Representation position from the cross references label (Under the element label or Footer).
cs: Poloha znázornění štítku křížového odkazu (pod štítkem prvku nebo v zápatí).

source: Display option from `cross references`_
cs: Volba zobrazení `křížových odkazů`_

source: The cross reference label can be created using the general variables from `Master`_ and `Slave`_ elements.
cs: Štítek křížového odkazu lze vytvořit pomocí obecných proměnných z `nadřízených`_ a `podřízených`_ prvků.

source: Figure: Project cross referencing properties window
cs: Obrázek: Okno s vlastnostmi křížových odkazů projektu

source: To define cross references settings:
cs: Pro stanovení nastavení křížových odkazů:

source: `Display`_ project properties PopUP window.
cs: `Zobrazte`_ vyskakovací okno s vlastnostmi projektu.

source: Go to **New folio** section.
cs: Jděte do části **Nový list**.

source: Go to **Cross references** tab.
cs: Jděte do karty **Křížové odkazy**.

source: Define the desired parameters for each field.
cs: Stanovte požadované parametry pro každé pole.

source: Press **OK** button to save the configuration changes and close project properties PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavření vyskakovacího okna s vlastnostmi projektu.

source: All pre-defined cross references properties defined at QElectroTech settings PopUP window will be automatically defined during `project creation`_ at `project properties`_. The cross references properties can be found at `Cross references tab`_ tab from `New folio`_ section.
cs: Všechny předem stanovené vlastnosti křížových odkazů stanovené ve vyskakovacím okně s nastavením QElectroTechu budou během vytváření projektu automaticky stanoveny ve `vlastnostech projektu`_. `Vlastnosti křížových odkazů`_ najdete v části `Nový list`_ v `kartě s křížovými odkazy`_.
