Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/properties/new_folio/folio.po
Languages: cs

source: Folio properties
cs: Vlastnosti listu

source: At QElectroTech, the `folio properties`_ can be common at all `folios`_ from the same `project`_. QElectroTech also allows that each `folio`_ has its own properties. For example, two `folios`_ from the same project will have the same size and title block but they can be created by different authors or they can have different revision.
cs: `Vlastnosti listu`_ v QElectroTechu mohou být společné pro všechny `listy`_ stejného `projektu`_. QElectroTech také umožňuje, aby každý `list`_ měl své vlastní vlastnosti. Například dva `listy`_ stejného projektu budou mít stejnou velikost a záhlaví výkresu, ale mohou být vytvořeny různými autory nebo mohou mít různé změnové záznamy.

source: To increase the working eficiency, QElectroTech provides the option to storage at the project Data some `project properties`_ pre-defined by the user. This feature allows the user avoiding to define many `folio properties`_ each time that the user `creates new folio`_ inside the `project`_.
cs: Pro zvýšení účinnosti práce QElectroTech nabízí možnost uložit v projektu Data některé `vlastnosti projektu`_ předem stanovené uživatelem. Tato funkce umožňuje uživateli vyhnout se stanovení mnoha `vlastností listu`_ pokaždé, když uživatel `vytvoří nový list`_ uvnitř `projektu`_.

source: QElectroTech allows defining automatically `folio properties`_ during `project creation`_. For more information about how to standarize some `folio properties`_ from `project`_ to `project`_, please refers to the `QElectroTech folio settings`_ section.
cs: QElectroTech umožňuje stanovit `vlastnosti listu`_ automaticky během `vytvoření projektu`_. Další informace o tom, jak některé `vlastnosti listu`_ od `projektu`_ k `projektu`_ standardizovat, najdete v části `nastavení listu v QElectroTechu`_.

source: The **Folio** tab from **New folio** settings section allows pre-defining some `folio properties`_:
cs: Karta **List** v části s nastavením **Nový list** umožňuje stanovení některých `vlastností listů`_ předem:

source: `Folio size`_.
cs: `Velikost listu`_.

source: `Folio title block`_.
cs: `Záhlaví výkresu v listu`_.

source: `Folio default variables values`_.
cs: `Hodnoty výchozích proměnných listu`_.

source: `Folio user variables`_.
cs: `Vlastní proměnné listu`_.

source: Figure: Project folio properties window
cs: Obrázek: Okno s vlastnostmi listu projektu

source: To define folio properties:
cs: Pro stanovení vlastností listu

source: `Display`_ project properties PopUP window.
cs: `Zobrazte`_ vyskakovací okno s vlastnostmi projektu.

source: Go to **New folio** section.
cs: Jděte do části **Nový list**.

source: Go to **Folio** tab.
cs: Jděte na kartu **List**.

source: Define the desired parameters for each field.
cs: Stanovte požadované parametry pro každé pole.

source: Press **OK** button to save the configuration changes and close project properties PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavření vyskakovacího okna s vlastnostmi projektu.

source: All pre-defined `folio properties`_ at `project properties`_ will be automatically defined during `folio creation`_ at `folio properties`_.
cs: Všechny `vlastnosti listu`_ předem stanovené ve `vlastnostech projektu`_ budou během `vytváření listu`_ automaticky stanoveny ve `vlastnostech listu`_.
