Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/properties/new_folio/folio_referencing.po
Languages: cs

source: Folio referencing properties
cs: Vlastnosti odkazování listu

source: QElectroTech allows creating schemas with multiple `folios`_, only part of the `schmea`_ is represented at each `folio`_. This means that part of a `conductor`_ can be at one `folio`_ and the continuation at a different `folio`_.
cs: QElectroTech umožňuje vytvářet výkresy s více `listy`_. Na každém `listu`_ je znázorněna pouze část `výkresu`_. To znamená, že část vodiče může být na jednom listu a pokračování na jiném listu.

source: QElectroTech provides folio referencing elements to indicate from where a `conductor`_ is coming or where it is going. These `elements`_ can display at the `workspace`_ from the `folio`_ some information about the folio referencing element linked. The iformation which should be displayed can be defiend by the user at **Folio referencing** tab from **New Folio** section of the `project properties`_.
cs: QElectroTech poskytuje prvky odkazující na list, které označují, odkud `vodič`_ přichází nebo kam směřuje. Tyto `prvky`_ mohou zobrazit na `pracovní ploše`_ `listu`_ některé informace o propojeném prvku odkazujícím na list. Informace, které se mají zobrazit, může uživatel stanovit na kartě **Odkazování listu** v části **Nový list** `vlastností projektu`_.

source: For more information about folio referencing, refer to `Reference folio following`_ and `Previous reference folio`_.
cs: Další informace o odkazování listu najdete v `Odkaz na následující list` a `Odkaz na předchozí list`.

source: Figure: Project folio referencing properties window
cs: Obrázek: Okno s vlastnostmi odkazování listu v projektu

source: To define folio referencing Label:
cs: Pro stanovení štítku odkazování listu:

source: `Display`_ project properties PopUP window.
cs: `Zobrazte`_ vyskakovací okno s vlastnostmi projektu.

source: Go to **New folio** section.
cs: Jděte do části **Nový list**.

source: Go to **Folio referencings** tab.
cs: Jděte na kartu **Odkazování listu**.

source: Define the desired parameters for each field.
cs: Stanovte požadované parametry pro každé pole.

source: Press **OK** button to save the configuration changes and close project properties PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavření vyskakovacího okna s vlastnostmi projektu.
