Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/select/select_all.po
Languages: cs

source: Select all objects
cs: Vybrání všech předmětů

source: QElectroTech allows selecting all objet from `workspace`_, all objects from the actived `folio`_, at the same time. All objects can be selected from `menu bar`_, `workspace`_ or using the corresponding keyboard shortcut.
cs: QElectroTech umožňuje vybrat všechny předměty v `pracovní ploše`_, současně všechny předměty v činném `listu`_. Všechny předměty lze vybrat přes `hlavní nabídku`_, pracovní plochu nebo pomocí odpovídající klávesové zkratky.

source: Select all objects from menu bar
cs: Vybrání všech předmětů přes hlavní nabídku

source: Select **Edit > Select All** to select all objects from the activated `folio`_.
cs: Pro vybrání všech předmětů v činném `listu`_ vyberte položku nabídky **Úpravy > Vybrat vše**.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Select all objects from workspace
cs: Vybírání všech předmětů v pracovní ploše

source: As many other CAD tools, QElectroTech allows selecting all elements from the `workspace`_, graphical area, using the mouse.
cs: Tak jako mnohé jiné nástroje CAD QElectroTech umožňuje vybrat všech prvků v `pracovní ploše`_, výkresové oblasti, pomocí myši.

source: Left click on the initial point from the rectangular area to be selected and displace the mouse without releasing up to the end point.
cs: Klepněte levým tlačítkem na počáteční bod obdélníkové oblasti, kterou chcete vybrat, a přesuňte myš bez uvolnění tlačítka nahoru na koncový bod.

source: Figure: QElectroTech selecting on workspace
cs: Obrázek: Výběr v pracovní ploše v QElectroTechu

source: Select all objects using keyboard shortcut
cs: Vybrání všech předmětů pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + a`` to select all objects from the activated `folio`_.
cs: Pro vybrání všech předmětů v činném `listu`_ stiskněte ``Ctrl + a``

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
