Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/text/text_edit.po
Languages: cs

source: Edit text field
cs: Upravení textového pole

source: Edit text field from menu bar
cs: Upravení textového pole přes hlavní nabídku

source: Select the `text field`_ which should be edited.
cs: Vyberte `textové pole`_, které se má upravit.

source: Select **Edit > Edit the selected object** menu item to display the `text editor PopUP window`_.
cs: Pro zobrazení `vyskakovacího okna s editorem textu`_ vyberte položku nabídky **Úpravy > Upravit vybraný předmět**.

source: Figure: QElectroTech edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Edit text field by right click
cs: Upravení textového pole klepnutím pravým tlačítkem myši

source: Right click on the `text field`_ which should be edited.
cs: Klepněte pravým tlačítkem myši na `textové pole`_, které se má upravit.

source: Select the option **Edit the text field** to display the `text editor PopUP window`_.
cs: Pro zobrazení `vyskakovacího okna s editorem textu`_ vyberte volbu **Upravit vybraný předmět**.

source: Figure: QElectroTech text field options
cs: Obrázek: Volby pro textové pole v QElectroTechu

source: Edit text field from selection properties panel
cs: Upravení textového pole v panelu s vlastnostmi výběru

source: Click on **Advanced Editor** button from `selection properties panel`_ to display the `text editor PopUP window`_.
cs: Pro zobrazení `vyskakovacího okna s editorem textu`_ klepněte v `panelu s vlastnostmi výběru`_ na tlačítko **Pokročilý editor**.

source: Figure: QElectroTech text field selection properties panel
cs: Obrázek: Panel s vlastnostmi výběru pro textové pole v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**

source: Edit text field using keyboard shortcut
cs: Upravení textového pole pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + e`` to display the `text editor PopUP window`_.
cs: Pro zobrazení `vyskakovacího okna s editorem textu`_ stiskněte ``Ctrl + e``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
