Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/text/text_move.po
Languages: cs

source: Move text
cs: Přesunutí textu

source: A `text field`_ is considered on object more in the `workspace`_. A `text field`_ can be move arround the `workspace`_ using the mouse or the keyboard like `elements`_, `basic objects`_ or `pictures`_.
cs: `Textové pole`_ je považováno za další předmět v `pracovní ploše`_. Textovým polem lze pohybovat kolem pracovní plochy pomocí myši nebo klávesnice tak jako s `prvky`_, `základními předměty`_ nebo `obrázky`_.

source: Move text field by mouse
cs: Přesunutí textového pole pomocí myši

source: Left clik on the `text field`_ which should be moved.
cs: Klepněte levým tlačítkem myši na `textové pole`_, které se má přesunout.

source: Without releasing, move the mouse to the new desired position.
cs: Bez uvolnění tlačítka přesuňte myš do požadované nové polohy.

source: Move text field from selection properties panel
cs: Přesunutí textového pole v panelu s vlastnostmi výběru

source: Select the `text field`_ which should be moved.
cs: Vyberte `textové pole`_, které se má přesunout.

source: Define coordinates **X** and **Y** from `text field`_ at `selection properties panel`_.
cs: Stanovte souřadnice `textového pole`_ **X** a **Y** v `panelu s vlastnostmi výběru`_.

source: Figure: QElectroTech text field selection properties panel
cs: Obrázek: Panel s vlastnostmi výběru pro textové pole v QElectroTechu

source: If the `selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**

source: Move text field by keyboard
cs: Přesunutí textového pole pomocí klávesnice

source: `Select the text field`_ which should be moved.
cs: Vyberte `textové pole`_, které se má přesunout.

source: Press the corresponding arrow (``Downwards``, ``Rightward``, ``Leftwards`` or ``Upwards``) to move the `text field`_ one grid row or column.
cs: Stiskněte příslušnou šipku (``Dolů``, ``Doprava``, ``Doleva`` nebo ``Nahoru``) pro přesunutí `textového pole`_ o jeden řádek mřížky nebo sloupec.
