Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_editor/title_block_save.po
Languages: cs

source: Save title block
cs: Uložení záhlaví výkresu

source: The current `title block`_ can be saved from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: Nynější `záhlaví výkresu`_ lze uložit přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: One `title block`_ is conformed by only one file with the format ``.titleblock``. The ``.titleblock`` extension is the native extension from QElectroTech `title blocks`_.
cs: Jedno `záhlaví výkresu`_ odpovídá pouze jednomu souboru ve formátu ``.titleblock``. Přípona ``.titleblock`` je nativní přípona `záhlaví výkresů`_ v QElectroTechu.

source: Save title block from menu bar
cs: Uložení záhlaví výkresu přes hlavní nabídku

source: Select **File > Save** menu item to save the `title block`_ changes.
cs: Pro uložení změn v `záhlaví výkresu`_ vyberte položku nabídky **Soubor > Uložit**.

source: Figure: QElectroTech title block editor File menu
cs: Obrázek: Nabídka Soubor editoru záhlaví výkresu v QElectroTechu

source: At the case that the opened `title block`_ has to overwrite an existing `title block`_ or it has to be saved as new `title block`_:
cs: V případě, že otevřené `záhlaví výkresu`_ musí přepsat stávající záhlaví výkresu nebo musí být uloženo jako nové záhlaví výkresu:

source: Select **File > Save as** menu item to display **Save as title block** PopUP window.
cs: Pro zobrazení vyskakovacího okna **Uložit jako záhlaví výkresu** vyberte položku nabídky **Soubor > Uložit**.

source: Figure: QElectroTech Save as title block PopUP window
cs: Obrázek: Vyskakovací okno pro uložení jako záhlaví výkresu v QElectroTechu

source: Select the `title block`_ which should be overwritten or the `parent collection`_ and the name for the new `title block`_.
cs: Vyberte `záhlaví výkresu`_, které má být přepsáno, nebo `rodičovskou sbírku`_ a název nového záhlaví výkresu.

source: Press **OK** button to save the `title block`_ and close the PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení `záhlaví výkresu`_ a zavřete vyskakovací okno.

source: The `title block`_ can also be directly saved as a new file in the Hard Disk directory desired:
cs: `Záhlaví výkresu`_ lze také přímo uložit jako nový soubor do požadovaného adresáře na pevném disku:

source: Select **File > Save to a file** menu item to display the File system PopUp window.
cs: Vyberte položku nabídky **Soubor > Uložit jako** pro zobrazení vyskakovacího okna se souborovým systémem.

source: Select the directory and the name from the title block file.
cs: Vyberte adresář a název ze souboru se záhlavím výkresu.

source: Save title block from toolbar
cs: Uložení záhlaví výkresu přes panel nástrojů

source: Select icon |icon_save| from `toolbar`_ to save `title block`_ changes.
cs: Vyberte ikonu |icon_save| v `panelu nástrojů`_ pro uložení změn v `záhlaví výkresu`_.

source: Select icon |icon_save_as| from `toolbar`_ to display the **Save as title block** PopUP window.
cs: Vyberte ikonu |icon_save_as| v `panelu nástrojů`_ pro zobrazení vyskakovacího okna **Uložit jako záhlaví výkresu**.

source: Select the `title block`_ which should be overwrited or the `parent collection`_ and the name for the new `title block`_.
cs: Vyberte `záhlaví výkresu`_, které má být přepsáno, nebo `rodičovskou sbírku`_ a název nového záhlaví výkresu.

source: If the `toolbar`_ is not displayed, it can be displaed from **Settings > Display > Tools**.
cs: Pokud se `panel nástrojů`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**.

source: Save title block using keyboard shortcut
cs: Uložení záhlaví výkresu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení pracovní výkonnosti.

source: Press ``Ctrl + s`` to save the title block changes.
cs: Stiskněte ``Ctrl + s`` pro uložení změn v záhlaví výkresu.

source: Press ``Ctrl + Shift + s`` to display the File system PopUp window.
cs: Stiskněte ``Ctrl +Shift+ s`` pro zobrazení vyskakovacího okna se souborovým systémem.

source: For more information about QElectroTech keyboard shortcut, refer to `Menu bar`_ section.
cs: Další informace o klávesových zkratkách QElectroTechu najdete v části `hlavní nabídka`_.
