Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/element/references/master_item_bind.po
Languages: cs

source: Bind slave item
cs: Provázání podřízeného prvku

source: It can happen that one device should be represented in the `project`_ using different `elements`_, power and control subsystem and auxiliary subsystems. All these `elements`_ should be considered as one device. QElectroTech works with `master`_ and `slave`_ elements which are linked using `cross references`_ to represent the device.
cs: Může se stát, že v `projektu`_ se má znázornit jedno zařízení pomocí různých `prvků`_, napájecí a řídicí podsoustavy a pomocných podsoustav. Všechny tyto prvky se mají považovat za jedno zařízení. QElectroTech pracuje pro znázornění zařízení s `nadřízenými`_ a `podřízenými`_ prvky, které jsou propojeny pomocí `křížových odkazů`_.

source: A `slave element`_ can be linked to a `master element`_ with the following steps:
cs: `Podřízený prvek`_ lze propojit s `nadřízeným prvkem`_ pomocí následující kroků:

source: Select the `master element`_ which should be linked from the `project collection`_ or from the `workspace`_.
cs: Vyberte `nadřízený prvek`_, který se má propojit, ve `sbírce projektu`_ nebo v `pracovní ploše`_.

source: Right click on the selected `element`_ and choose the option **Edit the element**.
cs: Klepněte pravým tlačítkem myši na vybraný `prvek`_ a vyberte volbu **Upravit prvek**.

source: Figure: QElectroTech element options
cs: Obrázek: Volby pro prvek v QElectroTechu

source: `Display`_ the **Cross-reference (Master)** tab from the element editor PopUP window.
cs: Ve vyskakovacím okně editoru prvku `zobrazte`_ kartu **Křížový odkaz (nadřízený)**.

source: Figure: QElectroTech cross reference tab element properties
cs: Obrázek: Vlastnosti prvku v kartě pro křížový odkaz v QElectroTechu

source: Search and select the desired `slave element`_ from the **Availabel elements** table.
cs: Vyhledejte a vyberte požadovaný `podřízený prvek`_ v tabulce **Dostupné prvky**.

source: Press **Bind item** |icon_bind| to link the `slave element`_ to the `master element`_.
cs: Stiskněte **Svázat položku** |icon_bind| pro propojení `podřízeného prvku`_ s `nadřízeným prvkem`_.

source: Press **Apply** to accept and save the changes.
cs: Pro přijetí a uložení změn stiskněte ``Použít``.

source: At the avaliable elements table, the `slave element`_ can also be linked by right click on the `element`_ and selectimg the option **Link the item**.
cs: V tabulce dostupných prvků lze `podřízený prvek`_ propojit také klepnutím pravým tlačítkem na `prvek`_ a výběrem volby **Spojit prvek**.
