Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/schema/element/references/master_item_untie.po
Languages: cs

source: Untie slave item
cs: Odvázání podřízeného prvku

source: Some times is necessary to delete previous work, QElectroTech allows breaking/deleting `links between elements (cross references)`_.
cs: Někdy je nutné odstranit předchozí práci. QElectroTech umožňuje rozbíjení/mazání `vazeb mezi prvky (křížové odkazy)`_.

source: A `Slave element`_ can be unlinked from a `master element`_ as follow:
cs: `Podřízený prvek`_ lze odpojit od `nadřízeného prvku`_ pomocí následující kroků:

source: Select the `master element`_ which should be unlinked from the `project collection`_ or from the `workspace`_.
cs: Vyberte `nadřízený prvek`_, který se má odpojit, ve `sbírce projektu`_ nebo v `pracovní ploše`_.

source: Right click on the selected `element`_ and choose the option **Edit the element**.
cs: Klepněte pravým tlačítkem myši na vybraný `prvek`_ a vyberte volbu **Upravit prvek**.

source: Figure: QElectroTech element options
cs: Obrázek: Volby pro prvek v QElectroTechu

source: `Display`_ the **Cross-reference (Master)** tab from the element editor PopUP window
cs: Ve vyskakovacím okně editoru prvku `zobrazte`_ kartu **Křížový odkaz (nadřízený)**

source: Figure: QElectroTech cross reference tab element properties
cs: Obrázek: Vlastnosti prvku v kartě pro křížový odkaz v QElectroTechu

source: Search and select the desired `slave element`_ from the **Element related** table.
cs: Vyhledejte a vyberte požadovaný `podřízený prvek`_ v tabulce **Spojené prvky**.

source: Press the **Untie item** button |icon_untie| to unlink the `slave element`_ from the `master element`_.
cs: Stiskněte **Odvázat položku** |icon_untie| pro odpojení `podřízeného prvku`_ od `nadřízeného prvku`_.

source: Press **Apply** to accept and save the changes.
cs: Pro přijetí a uložení změn stiskněte ``Použít``.

source: The `slave element`_ can also be unlinked by right clik on the `element`_ and selecting the option **Unlink the item**.
cs: `Podřízený prvek`_ lze odpojit také klepnutím pravým tlačítkem myši na `prvek`_ a výběrem volby **Odpojit prvek**.
