Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/properties/element_properties_display.po
Languages: cs

source: Display element properties
cs: Zobrazení vlastností prvku

source: The `element properties`_ can be displayed at the `selection properties panel`_ or in a popUP window. At the case of working without `selection properties panel`_, the properties can be displayed from `menu bar`_, `workspace`_ or using keyboard shortcut.
cs: `Vlastnosti prvku`_ lze zobrazit v `panelu s vlastnostmi výběru`_ nebo ve vyskakovacím okně. V případě práce bez `panelu s vlastnostmi výběru`_ je možné vlastnosti zobrazit přes `hlavní nabídku`_, `pracovní plochu`_ nebo pomocí klávesové zkratky.

source: At the case of using the `selection properties panel`_, selecting the `element`_ is enough to display automatically the `element properties`_ at the `panel`_.
cs: V případě použití `panelu s vlastnostmi výběru`_ vybrání `prvku`_ stačí k automatickému zobrazení `vlastností prvku`_ v `panelu`_.

source: If the `Selection properties panel`_ is not displayed, it can be displayed from **Settings > Display > Selection properties**.
cs: Pokud se `panel s vlastnostmi výběru`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Vlastnosti výběru**.

source: Display element properties from menu bar
cs: Zobrazení vlastností prvku přes hlavní nabídku

source: Select the `element`_ which `properties`_ should be displayed.
cs: Vyberte `prvek`_, jehož `vlastnosti`_ se mají zobrazit.

source: Select **Edit > Edit this element** menu item to display the element properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi prvku vyberte položku nabídky **Úpravy > Upravit tento prvek**.

source: Figure: QElectroTech Edit menu
cs: Obrázek: Nabídka pro úpravy QElectroTechu

source: Display element properties from workspace
cs: Zobrazení vlastností prvku z pracovní plochy

source: Right click on the `element`_ which `properties`_ should be displayed.
cs: Klepněte pravým tlačítkem myši na `prvek`_, jehož `vlastnosti`_ se mají zobrazit.

source: Select **Edit this element** option to display the element properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi prvku vyberte volbu **Upravit tento prvek**.

source: Figure: QElectroTech element options
cs: Obrázek: Volby pro prvek v QElectroTechu

source: Display element properties using keyboard shortcut
cs: Zobrazení vlastností prvku pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + e`` to display the element properties PopUP window.
cs: Pro zobrazení vyskakovacího okna s vlastnostmi prvku stiskněte ``Ctrl + E``.

source: For more information about QElectroTech keyboard shortcut, refer to `menu bar`_ section.
cs: Další informace o klávesové zkratce pro QElectroTech najdete v části k `hlavní nabídce`_.
