Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/element/properties/element_information.po
Languages: cs

source: Element information
cs: Informace o prvku

source: The element information section provides all information from the `element`_ which can be exported to the `Bill of Materials (BOM)`_. At this section the avaliable information is:
cs: Část s údaji o prvku poskytuje všechny informace k `prvku`_ které lze vyvést do `kusovníku (BOM)`_. V této části jsou dostupné informace:

source: Element label
cs: Popis prvku

source: Element location in the system
cs: Umístění prvku v systému

source: Element article number
cs: Číslo článku prvku

source: Element manufacturer
cs: Výrobce prvku

source: Element supplier
cs: Dodavatel prvku

source: Etc.
cs: Atd.

source: The element information section is only available for `simple`_, `master`_ or `terminal block`_ `elements`_.
cs: Část s údaji o prvku je dostupná pouze pro prvky `jednoduchý`_, `nadřízený`_ nebo `svorkovnice`_.

source: Figure: QElectroTech information element properties
cs: Obrázek: Informace o vlastnostech prvku v QElectroTechu
