Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/export&print/create_pdf.po
Languages: cs

source: Create a PDF from a project
cs: Vytvoření PDF z projektu

source: The active `project`_ can be exported to PDF from the `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: Činný `projekt`_ lze vyvést do PDF přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: Check that the active `project`_ is the `project`_ that should be printed.
cs: Zkontrolujte, zda činný `projekt`_ je projektem, který se má vytisknout.

source: The current version from QElectroTech, version 0.7, does not allow keeping the element links on the PDF document.
cs: Nynější verze QElectroTechu, verze 0.7, neumožňuje zachování odkazů na prvky v dokumentu PDF.

source: Export project to PDF from menu bar
cs: Vyvedení projektu do PDF přes hlavní nabídku

source: Select **File > Print** menu item to open the printing PopUP window.
cs: Pro otevření vyskakovacího okna pro tisk vyberte položku nabídky **Soubor > Tisk**.

source: Select Print to PDF a file check button.
cs: Vyberte tlačítko pro tisk souboru do PDF.

source: Select the directory where to save the PDF file
cs: Vyberte adresář, kam chcete soubor PDF uložit

source: Figure: QElectroTech printing PopUP window
cs: Obrázek: Vyskakovací okno pro tisk v QElectroTechu

source: Press **Ok** Button to open the preview printing PopUP window.
cs: Pro otevření vyskakovacího okna pro náhled tisku stiskněte tlačítko **OK**.

source: Figure: QElectroTech printing preview PopUP window
cs: Obrázek: Vyskakovací okno s náhledem tisku v QElectroTechu

source: Select the `folios`_ that should be printed.
cs: Vyberte `listy`_, které se mají vytisknout.

source: Select the printing option.
cs: Vyberte volbu pro tisk.

source: Press **Print** Button.
cs: Stiskněte tlačítko **Tisk**.

source: If the folio list is not display, select the icon |icon_folio_list| from the toolbar.
cs: Pokud se seznam listů nezobrazí, vyberte ikonu |icon_folio_list| v panelu nástrojů.

source: If the print options panel is not display, select the icon |icon_print_options| from the toolbar.
cs: Pokud se nezobrazí panel s volbami pro tisk, vyberte ikonu |icon_print_options| v panelu nástrojů.

source: Export project to PDF from toolbar
cs: Vyvedení projektu do PDF přes pruh s nástroji

source: Select the icon |document-print| from the `toolbar`_ to open the printing PopUP window.
cs: Pro otevření vyskakovacího okna pro tisk vyberte ikonu |document-print| v `pruhu s nástroji`_

source: Follow the steps defined at the ``printing project from menu bar`` section.
cs: Postupujte podle kroků stanovených v části k ``tisku projektu přes hlavní nabídku``.

source: If the `toolbar`_ is not displayed, it can be displaed from **Settings > Display > Tools**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**

source: Export project to PDF using keyboard shortcut
cs: Vyvedení projektu do PDF pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + p`` to open the printing PopUP window.
cs: Pro otevření vyskakovacího okna pro tisku stiskněte ``Ctrl + p``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
