Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/export&print/print.po
Languages: cs

source: Print project
cs: Tisk projektu

source: The active `project`_ can be printed from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: Činný `projekt`_ lze vytisknout přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: Check that the active `project`_ is the `project`_ that should be printed.
cs: Zkontrolujte, zda činný `projekt`_ je projektem, který se má vytisknout.

source: Print project from menu bar
cs: Vytištění projektu do PDF přes hlavní nabídku

source: Select **File > Print** menu item to open the printing PopUP window.
cs: Pro otevření vyskakovacího okna pro tisk vyberte položku nabídky **Soubor > Tisk**.

source: Click **Print to a physical printer** check button.
cs: Klepněte na tlačítko **Tisk na fyzické tiskárně**.

source: Figure: QElectroTech printing PopUP window
cs: Obrázek: Vyskakovací okno pro tisk v QElectroTechu

source: Press **Ok** Button to open the selection printer PopUp window.
cs: Pro otevření vyskakovacího okna pro tisk výběru stiskněte tlačítko **OK**.

source: Select printer and the preview printing PopUP window will be displayed.
cs: Vyberte tiskárnu a zobrazí se vyskakovací okno s náhledem na tisk.

source: Figure: QElectroTech printing options PopUP window
cs: Obrázek: Vyskakovací okno s volbami pro tisk v QElectroTechu

source: Select the `folios`_ which should be printed.
cs: Vyberte `listy`_, které se mají vytisknout.

source: Figure: QElectroTech printing preview PopUP window
cs: Obrázek: Vyskakovací okno s náhledem tisku v QElectroTechu

source: Select the printing option.
cs: Vyberte volbu pro tisk.

source: Press **Print** Button.
cs: Stiskněte tlačítko **Tisk**.

source: If the folio list is not displayed, select the icon |icon_folio_list| from the toolbar.
cs: Pokud se seznam listů nezobrazí, vyberte ikonu |icon_folio_list| v panelu nástrojů.

source: If the printing options panel is not displayed, select the icon |icon_print_options| from the toolbar.
cs: Pokud se nezobrazí panel s volbami pro tisk, vyberte ikonu |icon_print_options| v panelu nástrojů.

source: Print project from toolbar
cs: Vytištění projektu přes pruh s nástroji

source: Select the icon |document-print| from the `toolbar`_ to open the printing PopUP window.
cs: Pro otevření vyskakovacího okna pro tisk vyberte ikonu |document-print| v `pruhu s nástroji`_

source: Follow the steps defined at the ``printing project from menu bar`` section.
cs: Postupujte podle kroků stanovených v části k ``tisku projektu přes hlavní nabídku``.

source: If the `toolbar`_ is not displayed, it can be displaed from **Settings > Display > Tools**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**

source: Print project using keyboard shortcut
cs: Vytištění projektu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + p`` to open the printing PopUP window.
cs: Pro otevření vyskakovacího okna pro tisku stiskněte ``Ctrl + p``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.

source: QElectroTech allows predefining printing settings for reducing the working configuration effort each time that a `project`_ have to be printed, refer to `printing settings`_ section for more information.
cs: QElectroTech umožňuje předem stanovit nastavení tisku pro omezení pracovního úsilí spojeného s nastavováním pokaždé, když je třeba `projekt`_ vytisknout. Další informace najdete v části k `nastavení vyvedení`_.
