Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_delete.po
Languages: cs

source: Delete title block
cs: Smazání záhlaví výkresu

source: The title blocks templates can only be deleted from `project panel`_. QElectroTech does not allow deleting templates from any menu item.
cs: Šablony záhlaví výkresů lze odstranit pouze z `panelu s projektem`_. QElectroTech neumožňuje mazání šablon z žádné položky nabídky.

source: If the `project panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**.
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**.

source: It is important to make difference between the `project embedded collection`_ and `QET`_ or `User`_ collection. The `project embedded collection`_ is in the project "database", delete information from the project does not change anything at QElectroTech or in the computer file system. Deleting information from `QET`_ or `User`_ collection deletes information from QElectroTech "database" and in the computer file system, the information deleted in these "databases" can never be recovered.
cs: Je důležité rozlišovat mezi `vloženou sbírkou projektu`_ a sbírkou `QET`_ nebo `vlastní`_. Vložená sbírka projektu je v "databázi" projektu, smazání informace z projektu nic nemění v QElectroTechu ani v souborovém systému počítače. Odstranění informací ze sbírky `QET`_ nebo vlastní odstraní informace z „databáze“ QElectroTechu a v souborovém systému počítače, informace smazané v těchto „databázích“ už nikdy nemohou být obnoveny.

source: Delete title block from project
cs: Smazání záhlaví výkresu z projektu

source: Right click on one title block template from `project embedded collection`_ which should be deleted.
cs: Klepněte pravým tlačítkem myši na vzor záhlaví výkresu `vložené sbírky projektu`_, který se má smazat.

source: Click the option **Delete this template** to delete the template form project "database".
cs: Pro smazání vzoru z "databáze" projektu klepněte na volbu **Smazat tento vzor**.

source: Figure: QElectroTech Project panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: Delete title block from collection
cs: Smazání záhlaví výkresu ze sbírky

source: Right click on the title block template from `QET`_ or `User`_ collections which should be deleted.
cs: Klepněte pravým tlačítkem myši na vzor záhlaví výkresu ve sbírce `QET`_ nebo `vlastní`_, který se má smazat.

source: Click the option **Delete this template** to delete the template form QElectroTech and from the file system.
cs: Pro smazání vzoru z QElectroTechu a ze souborového systému klepněte na volbu **Smazat tento vzor**.

source: Press **YES** to confirm the action.
cs: Stiskněte **ANO** pro potvrzení kroku.

source: Figure: QElectroTech delete title block confirmation PopUP window
cs: Obrázek: Vyskakovací okno pro potvrzení smazání záhlaví výkresu v QElectroTechu

source: The template deleted from one collection cannot be recovered, it will be deleted from QElectroTech "dataabse" and from the computer file system. Be sure about the operation.
cs: Vzor odstraněný z jedné sbírky nelze obnovit, bude odstraněn z „databáze“ QElectroTechu a ze souborového systému počítače. Buďte si jisti touto operací.
