Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/title_block_new.po
Languages: cs

source: Create new title block
cs: Vytvoření nového záhlaví výkresu

source: Creating new title block from cero is not allowed, one template can only be created starting from an other. If no template is choosed, the default title block from `QET collection`_ is the base to create a new title block.
cs: Vytváření nového záhlaví výkresu od nuly není povoleno, může být vytvořena pouze jeden vzor počínající z jiného. Pokud není vybrán žádný vzor, základem pro vytvoření nového záhlaví výkresu je výchozí záhlaví výkresu ve `sbírce QET`_.

source: Figure: QElectroTech default title block
cs: Obrázek: Výchozí záhlaví výkresu v QElectroTechu

source: Create title block from menu bar
cs: Vytvoření záhlaví výkresu přes hlavní nabídku

source: Select **Project > Project properties > New folio** menu item to display `default folio properties`_ from `project`_.
cs: Pro zobrazení `výchozích vlastností listu`_ z `projektu`_ vyberte položku nabídky **Projekt > Vlastnosti projektu > Nový list**.

source: Go to `title block informations`_ and select the base title block that should be used to create the new one.
cs: Jděte do `údajů v záhlaví výkresu`_ a vyberte záhlaví výkresu, které se má použít k vytvoření nového.

source: Select the option **Duplicate and edit this template**.
cs: Vyberte volbu **Zdvojit a upravit tento vzor**.

source: Figure: QElectroTech New folio properties PopUP window
cs: Obrázek: Vyskakovací okno s vlastnostmi nového listu v QElectroTechu

source: Choose the name for the new title block template and press **OK** to create it.
cs: Vyberte název nového vzoru záhlaví výkresu a stiskněte **OK** pro jeho vytvoření.

source: Figure: QElectroTech New folio save PopUP window
cs: Obrázek: Vyskakovací okno pro uložení nového listu v QElectroTechu

source: Create title block from folio properties
cs: Vytvoření záhlaví výkresu přes vlastnosti listu

source: `Display folio properties`_ from one of the `folios`_ of the `project`_.
cs: `Zobrazení vlastností listu`_ z jednoho z `listů`_ `projektu`_.

source: Edit the template and save it.
cs: Upravte vzor a uložte jej.

source: Choose the parent collection and the name from the new title block template, then press **OK** to create it.
cs: Vyberte rodičovskou sbírku a název nového vzoru záhlaví výkresu, potom stiskněte **OK** pro jeho vytvoření.

source: Create title block from project panel
cs: Vytvoření záhlaví výkresu přes panel s projektem

source: Right click on the `user title blocks collection`_ from `project panel`_.
cs: Klepněte pravým tlačítkem myši na `vlastní sbírku záhlaví výkresů`_ `panel s projektem`_.

source: Click the option **New template** to add a new title block with the default template from `QET collection`_ as base.
cs: Klepněte na volbu **Nový vzor** pro přidání nového záhlaví výkresu s výchozím vzorem ze `sbírky QET`_ jako základem.

source: Figure: QElectroTech Project panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: If the `project panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**.
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**.
