Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/folio/title_block/what_*.po
Languages: is

source: What is the title block?
is: Co je to záhlaví?

source: The title block of a drawing is a table which usually is placed at the bottom from the drawing. The title block is the responsible to provide all necessary information to identify and verify the drawing validity.
is: Záhlaví výkresu je tabulka, která je obvykle umístěna ve spodní části výkresu. Záhlaví je odpovědné za poskytnutí všech potřebných informací k rozpoznání a ověření platnosti výkresu.

source: Figure: QElectroTech Title block example
is: Obrázek: Příklad záhlaví v QElectroTechu

source: Some information which can be found at a title block is:
is: Některé informace, které lze najít v záhlaví, jsou:

source: Drawing / Schema title
is: Název výkresu

source: Drawing / Schema number
is: Číslo výkresu

source: Drawing / Schema size (Horizontal A3 sheet is the more common at electrical shemas)
is: Velikost výkresu/místa na kreslení (u elektrických výkresů je běžnější vodorovný list formátu A3)

source: Revision index
is: Číslo změny

source: Author
is: Autor

source: Date
is: Datum

source: License (Ex.: `ISO 16016`_ protection notices for restricting the use of documents and products)
is: Licence (Příklad: `ISO 16016`_ ochranná upozornění na omezení používání dokumentů a výrobků)

source: Refer to `IEC 61082-1`_ norm for more detailed information about the recomended content that should be included in the title block.
is: Podívejte se do normy `IEC 61082-1`_, kde naleznete podrobnější informace o doporučeném obsahu, který by měl být zahrnut v záhlaví.

source: As table, the elemets from a title block are:
is: Prvky záhlaví jsou jako v tabulce:

source: `Cell`_
is: `Buňka`_

source: `Column`_
is: `Sloupec`_

source: `Row`_
is: `Řádek`_
