Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/close_project.po
Languages: cs

source: Close Project
cs: Zavření projektu

source: The user can close a `project`_ at any time. If the current work wants to be saved before closing the project, refer to `save`_ section. Even so, QElectroTech display an automatic message to `save project`_ if any modification has been created on it.
cs: Uživatel může `projekt`_ kdykoli zavřít. Pokud se má nynější práce před zavřením projektu uložit, s postupem se seznámíte v části `uložit`_. QElectroTech přesto zobrazí automatickou zprávu pro `uložení projektu`_, pokud v něm byla vytvořena nějaká změna.

source: Figure: QElectroTech Save message
cs: Obrázek: Zpráva o uložení v QElectroTechu

source: Closing the current project can be done from `menu bar`_, `toolbar`_, `projects panel`_, `projects tab bar`_ and using the corresponding keyboard shortcut.
cs: Zavření nynějšího projektu lze udělat přes `hlavní nabídku`_, `panel nástrojů`_, `panel s projekty`_, `pruh karet s projekty`_ a pomocí odpovídající klávesové zkratky.

source: At the case that more than one `project`_ are opened, the active `project`_ will be the `project`_ which will be closed.
cs: V případě, že je otevřen více než jeden `projekt`_, činný projekt bude projektem, který bude zavřen.

source: Close project from menu bar
cs: Zavření projektu přes hlavní nabídku

source: Select **File > Close** menu item to close the active `project`_.
cs: Pro zavření činného `projektu`_ vyberte položku nabídky **Soubor > Zavřít**.

source: Figure: QElectroTech File menu
cs: Obrázek: Nabídka pro soubor v QElectroTechu

source: Close project from toolbar
cs: Zavření projektu přes pruh s nástroji

source: Select the icon |project-close| from `toolbar`_ to close the active `project`_.
cs: Pro zavření činného `projektu`_ vyberte ikonu |project-close| v `pruhu s nástroji`_

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**.
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**.

source: Close project from projects panel
cs: Zavření projektu přes panel s projekty

source: The advantage of clossing `projects`_ from `projects panel`_ is the posibility to close `projects`_ which are opened and are not the active `project`_.
cs: Výhodou zavření `projektů`_ přes `panel s projekty`_ je možnost uzavřít `projekty`_, které jsou otevřené a nejsou činnými projekty.

source: Right click on the opened `project`_ from the `projects panel`_ tree wich should be closed.
cs: Klepněte pravým tlačítkem myši na otevřený `projekt`_ ve stromu `panelu s projekty`_, který se má zavřít.

source: Select **Close this project** to close the selected `project`_.
cs: Pro zavření vybraného `projektu`_ vyberte položku nabídky **Zavřít tento projekt**.

source: Figure: QElectroTech projects panel
cs: Obrázek: Panel s projekty v QElectroTechu

source: If the `projects panel`_ is not displayed, it can be displayed from **Settings > Display > Projects**.
cs: Pokud se `panel s projekty`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Projekty**.

source: Close project from projects tabs bar
cs: Zavření projektu přes pruh karet s projekty

source: All opened `projects`_ can be visible at the `projects tab bar`_ that is displayed at top from the `workspace`_. The user can close an opened `projects`_, regardless of whether the project is active, with a click on the close tab |project_tab_close_tab| from the project tab.
cs: Všechny otevřené `projekty`_ lze zobrazit v `pruhu karet s projekty`, který je zobrazen nahoře `pracovní plochy`_. Uživatel může zavřít otevřené `projekty`_ bez ohledu na to, zda je projekt činný, klepnutím na zavření karty |project_tab_close_tab| na kartě s projektem.

source: At the case that the `projects`_ are displayed as PopUP windows, they can be closed with a click on the close tab |project_window_close_tab| which is placed at the top right corner.
cs: V případě, že se `projekty`_ zobrazí jako vyskakovací okna, mohou být zavřeny klepnutím na zavření karty |project_window_close_tab|, které je umístěno v pravém horním rohu.

source: Displaying the `projects`_ using a tab bar or using PopUP windows can be choosed at **Display > Display projects**.
cs: Zobrazení `projektů`_ pomocí pruhu karet nebo pomocí vyskakovacích oken může být vybráno v **Zobrazení > Zobrazit projekty**.

source: Close project using keyboard shortcut
cs: Zavření projektu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + f4`` to close the active `project`_.
cs: Stiskněte klávesy ``Ctrl + f4`` pro zavření činného `projektu`_.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.
