Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/open_project.po
Languages: cs

source: Open Project
cs: Otevření projektu

source: Opening a `project`_ saved somewhere from the computer Hard Disk or local server can be done from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: Otevření `projektu`_ uloženého někde na pevném disku počítače nebo místním serveru lze provést přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: A `project`_ is conformed by a simgle file with ``.qet`` format. The ``.qet`` extension is the native extension from QElectroTech. Even so, QElectroTech allows also working with Extensible Markup Language files, files with extension ``.xml``.
cs: `Projekt`_ odpovídá jednomu souboru ve formátu ``.qet``. Přípona ``.qet`` je původní přípona QElectroTechu. QElectroTech ovšem umožňuje práci i se soubory Extensible Markup Language, což jsou soubory s příponou ``.xml``.

source: Open project from menu bar
cs: Otevření projektu přes hlavní nabídku

source: Select **File > Open** menu item to open the search file PopUP window.
cs: Pro otevření vyskakovacího okna pro hledání souboru vyberte položku nabídky **Soubor > Otevřít**.

source: Figure: QElectroTech file menu
cs: Obrázek: Nabídka pro soubor v QElectroTechu

source: Search the `project`_ in the computer
cs: Vyhledejte `projekt`_ v počítači

source: Press **Open** button to close the search file PopUP window and open the `project`_.
cs: Pro zavření vyskakovacího okna pro hledání souboru a otevření `projektu`_ stiskněte tlačítko **Otevřít**.

source: Open project from toolbar
cs: Otevření projektu přes pruh s nástroji

source: Select the icon |project| from `toolbar`_ to open the search file PopUP window.
cs: Pro otevření vyskakovacího okna pro hledání souboru vyberte ikonu |project| v `pruhu s nástroji`_

source: Search the `project`_ at the computer
cs: Vyhledejte `projekt`_ v počítači

source: If the `toolbar`_ is not displayed, it can be displayed from **Settings > Display > Tools**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**

source: Open project using keyboard shortcut
cs: Otevření projektu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + o`` to open the search file PopUP window.
cs: Pro otevření vyskakovacího okna pro hledání souboru stiskněte ``Ctrl + o``.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.

source: Files history
cs: Historie souboru

source: When QElectroTech has already been used, exists the posibility to open a `project`_ created, opened and/or saved previously. **File History** has been integrated.
cs: Pokud již byl QElectroTech použit, existuje možnost otevřít vytvořený `projekt`_, otevřený a/nebo uložený dříve. **Historie souboru** byla začleněna.

source: Select **File > Latest files** menu item to display the file history from QElectroTech.
cs: Pro zobrazení historie souboru v QElectroTechu vyberte položku nabídky **Soubor > Nedávno otevřené**.

source: Click on the `project`_ file that should be opened.
cs: Klepněte pravým tlačítkem myši na `projekt`_, který se má otevřít.

source: Figure: QElectroTech File History
cs: Obrázek: Historie souboru v QElectroTechu
