Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/project/save_project.po
Languages: cs

source: Save Project
cs: Uložení projektu

source: The current `project`_ can be saved from `menu bar`_, `toolbar`_ and using the corresponding keyboard shortcut.
cs: Nynější `projekt`_ lze uložit přes `hlavní nabídku`_, `panel nástrojů`_ a pomocí odpovídající klávesové zkratky.

source: One `project`_ is conformed by a simple file with ``.qet`` format. The ``.qet`` extension is the native extension from QElectroTech.
cs: Jeden `projekt`_ odpovídá jednomu souboru ve formátu ``.qet``. Přípona ``.qet`` je původní přípona QElectroTechu.

source: Save project from Menu bar
cs: Uložení projektu přes hlavní nabídku

source: Select **File > Save** menu item to save the active `project`_.
cs: Pro uložení činného `projektu`_ vyberte položku nabídky **Soubor > Uložit**.

source: At the case that the `project`_ has already been saved and wants to be saved as a different `project`_, different name and/or directory:
cs: V případě, že `projekt`_ již byl uložen a má být uložen jako jiný projekt, jiný název a/nebo adresář:

source: Select **File > Save as** menu item to save the active `project`_ as a new `project`_.
cs: Pro uložení činného `projektu`_ jako nového `projektu`_ vyberte položku nabídky **Soubor > Uložit jako**.

source: Save project from toolbar
cs: Uložení projektu přes pruh s nástroji

source: Select the icon |document-save| from `toolbar`_ to save the active `project`_.
cs: Pro uložení činného `projektu`_ vyberte ikonu |document-save| v `panelu nástrojů`_

source: Select the icon |document-save-as| from `toolbar`_ to save the active `project`_ as a new `project`_.
cs: Pro uložení činného `projektu`_ vyberte ikonu |document-save-as| v `panelu nástrojů`_

source: If the `toolbar`_ is not displayed, it can be displaed from **Settings > Display > Tools**
cs: Pokud se `pruh s nástroji`_ nezobrazí, lze jej zobrazit přes **Nastavení > Zobrazení > Nástroje**

source: Save project using keyboard shortcut
cs: Uložení projektu pomocí klávesové zkratky

source: QElectroTech allows using keyboard shortcut to increase the working efficiency.
cs: QElectroTech umožňuje používat klávesovou zkratku ke zvýšení účinnosti práce.

source: Press ``Ctrl + s`` to save the active `project`_.
cs: Stiskněte klávesy ``Ctrl + s`` pro uložení činného `projektu`_.

source: For more information about QElectroTech keyboard shortcuts, refer to `menu bar`_ section.
cs: Další informace o klávesových zkratkách v QElectroTechu najdete v části k `hlavní nabídce`_.

source: QElectroTech allows creating backup from `project`_ periodically. This option should be configurated at **Settings > Configure QElectroTech > Projects**.
cs: QElectroTech umožňuje pravidelné vytváření záloh `projektu`_. Tato volba se nastavuje v **Nastavení > Nastavit QElectroTech > Projekty**.
