Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/new_project/cross_references_settings.po
Languages: cs

source: Cross references settings
cs: Nastavení křížových odkazů

source: QElectroTech provides the option to storage at the Data from the application some `project properties`_ pre-defined by the user. This feature allows the user avoiding to define many `project properties`_ each time that the user `creates new projects`_.
cs: QElectroTech poskytuje možnost ukládat na Data z aplikace některé `vlastnosti projektu`_ stanovené předem uživatelem. Tato funkce umožňuje uživateli vyhnout se stanovení mnoha `vlastností projektu`_ pokaždé, když uživatel vytvoří nové projekty.

source: The **Cross references** tab from **New project** settings section allows pre-defining some `cross references properties`_:
cs: Karta **Křížové odkazy** v části s nastavením **Nový projekt** umožňuje stanovení některých `křížových odkazů`_ předem:

source: Cross references type (Coil, organ of protection or Switch/button).
cs: Typ křížových odkazů (cívka, ochrana nebo přepínač/tlačítko).

source: Cross references label
cs: Štítek křížových odkazů

source: Representation position cross references label (Under the label of the element or Footer).
cs: Štítek křížových odkazů v poloze reprezentace (pod štítkem prvku nebo zápatí).

source: Figure: QElectroTech New project cross references settings
cs: Obrázek: Nastavení křížových odkazů v novém projektu v QElectroTechu

source: To define cross references settings:
cs: Pro stanovení nastavení křížových odkazů:

source: `Display`_ QElectroTech settings PopUP window.
cs: `Zobrazte` vyskakovací okno s nastavením QElectroTechu.

source: Go to **New project** section.
cs: Jděte do části **Nový projekt**.

source: Go to **Cross references** tab.
cs: Jděte do karty **Křížové odkazy**.

source: Define the desired parameters for each field.
cs: Stanovte požadované parametry pro každé pole.

source: Press **OK** button to save the configuration changes and close settings PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavření vyskakovacího okna s nastavením.

source: All pre-defined cross references properties defined at QElectroTech settings PopUP window will be automatically defined during `project creation`_ at `project properties`_. The cross references properties can be found at `Cross references tab`_ tab from `New folio`_ section.
cs: Všechny předem stanovené vlastnosti křížových odkazů stanovené ve vyskakovacím okně s nastavením QElectroTechu budou během `vytváření projektu`_automaticky stanoveny ve `vlastnostech projektu`_. `Vlastnosti křížových odkazů`_ najdete v části `Nový list`_ v `kartě s křížovými odkazy`_.
