Repository: Int-Circuit/qelectrotech-doc
Catalog: source/locale/*/LC_MESSAGES/preferences/new_project/folio_referencings_settings.po
Languages: cs

source: Folio referencings settings
cs: Nastavení odkazování listů

source: QElectroTech provides the option to storage at the Data from the application some `project properties`_ pre-defined by the user. This feature allows the user avoiding to define many `project properties`_ each time that the user `creates new projects`_.
cs: QElectroTech poskytuje možnost ukládat na Data z aplikace některé `vlastnosti projektu`_ stanovené předem uživatelem. Tato funkce umožňuje uživateli vyhnout se stanovení mnoha `vlastností projektu`_ pokaždé, když uživatel `vytvoří nové projekty`_.

source: The **Folio referencings** tab from **New project** settings section allows pre-defining the formula which should define the label variable from `Reference folio following`_ and `Previous reference folio`_.
cs: Karta **Odkazování listů** v části s nastavením pro *Nový projekt** umožňuje předem stanovit vzorec, který má stanovit proměnnou štítku v `Odkaz na následující list`_ a `Odkaz na předchozí list`_.

source: Figure: QElectroTech New project folio referencings settings
cs: Obrázek: Nastavení odkazování listů v novém projektu v QElectroTechu

source: To define folio referencings settings:
cs: Pro stanovení nastavení odkazování listů:

source: `Display`_ QElectroTech settings PopUP window.
cs: `Zobrazení` vyskakovacího okna s nastavením QElectroTechu.

source: Go to **New project** section.
cs: Jděte do části **Nový projekt**.

source: Go to **Folio referencings** tab.
cs: Jděte na kartu **Odkazování listů**.

source: Define the desired parameters for each field.
cs: Stanovte požadované parametry pro každé pole.

source: Press **OK** button to save the configuration changes and close settings PopUP window.
cs: Stiskněte tlačítko **OK** pro uložení změn v nastavení a zavření vyskakovacího okna s nastavením.

source: All pre-defined folio referencings properties defined at QElectroTech settings PopUP window will be automatically defined during `project creation`_ at `project properties`_. The folio referencings properties can be found at `Folio referencings tab`_ from `New folio`_ section.
cs: Všechny předem stanovené `vlastnosti listů` stanovené ve vyskakovacím okně s nastavením QElectroTechu budou automaticky stanoveny během `vytváření projektu`_ ve `vlastnostech projektu`_. `Vlastnosti listu`_ najdete v `kartě listu`_ v části Nový list.
